[
  {
    "week": "1",
    "month": "september",
    "items": [
      {
        "date": "14 sept",
        "title": "Gesprek met Micky",
        "text": "Eerste gesprek met begeleider Micky van Zeijl. Heb veel moeite met het concreet maken van het probleem. Er zweven meerdere problemen door m'n hoofd. Welke een connectie met elkaar hebben. Lastig om er nog grip op te krijgen",
        "lists": [
          {
            "items": [
              "Zo snel mogelijk bouwen",
              "binnen prototype itereren",
              "research > wat bestaat er allemaal",
              "keuze's onderbouwen > iteraties beargumenteren",
              "helder concreet probleem (geen oplossing)"
            ]
          }
        ],
        "articles": [
          "https://lifely.nl/blog/de-lifely-startup-introducing-bundlin"
        ]
      },
      {
        "date": "15 sept",
        "title": "Trends",
        "text": "Hoeveel wordt er over het onderwerp geschreven?",
        "lists": [
          {
            "items": [
              "Hype Cycle",
              "Integratie tussen platforms > trend?",
              "Steeds meer Fe technologieen > trend? ",
              "Steeds meer informatie beschikbaar > FE Fatigue > trend?",
              "co creatie tussen medewerkers?"
            ]
          }
        ]
      }
    ]
  },
  {
    "week": "2",
    "month": "september",
    "items": [
      {
        "date": "18 sept",
        "title": "Design Brief bootcamp",
        "text": "Sommige onderdelen zijn nog lastig om in te vullen. Daarom overgeslagen.",
        "images": [
          {
            "src": "/assets/images/week-2/design-brief-bootcamp/1.jpg",
            "caption": ""
          },
          {
            "src": "/assets/images/week-2/design-brief-bootcamp/2.jpg",
            "caption": ""
          },
          {
            "src": "/assets/images/week-2/design-brief-bootcamp/3.jpg",
            "caption": ""
          },
          {
            "src": "/assets/images/week-2/design-brief-bootcamp/4.jpg",
            "caption": ""
          }
        ],
        "articles": []
      },
      {
        "date": "19 sept",
        "title": "Orienting Expert reviews",
        "text": "Om meer grip te krijgen op het probleem heb ik een aantal developers geïnterviewd. Heel erg veel aan gehad, helaas heb ik het eerste gesprek met Matt niet opgenomen, daarintegen wel de bevindingen genoteerd. Bij Arnout en Jeroen heb ik de bevindingen niet letterlijk uitgeschreven maar het wel opgenomen",
        "images": [
          {
            "src": "assets/images/week-2/orienting-expert-review/aantekening-jeroen-1.jpg",
            "caption": "Eerste schets van correlatie tussen de verschillende problemen, voortgekomen uit het gesprek met jeroen"
          },
          {
            "src": "assets/images/week-2/orienting-expert-review/aantekening-jeroen-2.jpg",
            "caption": "Eerste schets van correlatie tussen de verschillende problemen, voortgekomen uit het gesprek met jeroen"
          }
        ],
        "audio": [
          {
            "title": "Interview met Arnout (Junior FE Dev)",
            "src": "/assets/audio/interview_arnout.m4a"
          },
          {
            "title": "Interview met Jeroen (senior FE Dev)",
            "src": "/assets/audio/interview_jeroen.m4a"
          }
        ],
        "pdf": "/assets/pdf/week-2/orienting-expert-review-matt.pdf"
      },
      {
        "date": "20 sept",
        "title": "Design Brief worksheet",
        "text": "Designbrief worksheet nog een keer uitwerken, gewoon in pages dit keer. Merk dat ik na het gesprek met jeroen echt duidelijkheid heb gekregen op het probleem. Het ligt bijna op het puntje van mn tong.",
        "pdf": "/assets/pdf/week-2/design-brief-worksheet.pdf"
      },
      {
        "date": "21 sept",
        "title": "Meeting Micky",
        "text": "Meeting ging goed, veel gesproken over het probleem en de volgende stappen. Eindelijk het idee dat ik dichterbij het probleem en het 'echt starten' van het project kom",
        "lists": [
          {
            "items": [
              "invetariseren op wat voor manier dev's nu content opslaan en delen",
              "card sorting > thema's voor seniors",
              "kijken hoe het gaat in andere sectoren",
              "design patterns",
              "interne scholing",
              "Ai learning",
              "Verschil tussen junior / medior /senior qua omgang met vakcontent",
              "Structuur brengen in de chaos < gebasseerd op het gedrag van FED's van TT"
            ]
          }
        ]
      },
      {
        "date": "22 sept",
        "title": "Grip krijgen op het probleem",
        "text": "Aantekeningen van schetsen tijdens het uitvogelen van de relatie tussen de verschillende problemen",
        "images": [
          {
            "src": "/assets/images/week-2/aantekeningen/aantekening-1.jpg"
          },
          {
            "src": "/assets/images/week-2/aantekeningen/aantekening-2.jpg"
          },
          {
            "src": "/assets/images/week-2/aantekeningen/aantekening-3.jpg"
          }
        ]
      }
    ]
  },
  {
    "week": "3",
    "month": "september",
    "items": [
      {
        "date": "25 sept",
        "title": "Het maken van een digitaal logboek",
        "text": "Vandaag ben ik begonnen met de opzet van een digitaal logboek. Ik gebruik hiervoor de Frontend Setup van TamTam. Hier ben ik al bekend mee en leek mij de meest voor de hand liggende optie omdat ik hiermee alle vrijheid heb die ik wel. Daarnaast kan ik gaande weg het traject dit logboek updaten met nieuwe functionaliteiten",
        "lists": [
          {
            "items": [
              "Alle content staat in JSON",
              "Uitgerenderd via Nunjucks",
              "Slick Slider voor image sliders",
              "ObjectPDF voor het renderen van PDF's",
              "<a href=\"http://www.github.com/tomsnep/logboek\">Link naar Github Repo klik dan </a>"
            ]
          }
        ]
      },
      {
        "date": "25 sept",
        "title": "Roadmap",
        "text": "Roadmap uitgewerkt in sketch",
        "pdf": "/assets/pdf/week-3/roadmap.pdf"
      },
      {
        "date": "27 sept",
        "title": "Design Brief",
        "text": "Final design brief",
        "pdf": "/assets/pdf/week-3/design-brief.pdf"
      }
    ]
  },

  {
    "week": "4",
    "month": "oktober",
    "items": [
      {
        "date": "3 okt",
        "title": "Best, Good & Bad practices van andere manieren om content op te slaan",
        "text": "Om te onderzoeken hoe andere platformen omgaan met het opslaan van content heb ik een Comparison Chart gemaakt met 7 verschillende features.",
        "pdf": "/assets/pdf/week-4/comparison-chart-saving.pdf"
      },
      {
        "date": "4 okt",
        "title": "Wat missen frontend developers tijdens het opslaan / delen van vakinhoudelijke content",
        "text": "Google Forms opgezet om te kijken hoe developers momenteel omgaan met het opslaan en delen van vakinhoudelijke content, of ze dit een fijne manier vinden en of ze denken dat dit beter kan. Helaas helaas is het niet mogelijk om de reponses te embedden op een externe website. Klik <a href=\"https://docs.google.com/forms/d/1vnM0mIAhs9yhQzqkb92ldcDYHt1JA51egwSfg6jKkX0/viewanalytics\" target=\"_blank\">hier voor de resultaten</a>",
        "form": "https://docs.google.com/forms/d/e/1FAIpQLSciLL8zQJnsJ1aQfafU39Wuh3rRlHF02V8xSTSHX6ibzuj2bQ/viewform?embedded=true"
      },
      {
        "date": "5 okt",
        "title": "Wat voor framework is het beste om te gebruiken voor rapid prototyping",
        "text": "Testjes gedaan met keystone.js en node.js. React is te ingewikkeld om in te duiken binnen deze korte tijd. Keystone.js is teveel gericht op een CMS. Node js was het lekkerst om mee te werken. Test was om "
      },
      {
        "date": "5 okt",
        "title": "Logboek verbeteringen - Accordion functionaliteit",
        "text": "Gekeken naar UX verbeteringen voor het logboek. De lijst werd te lang. Daarom accordion functionaliteit ingebouwd. De week kan worden uitgeklapt. Om ervoor te zorgen dat als je onderaan een lange week terecht komt en de volgende open klapt de boel niet verspringt wordt er automatisch naar de bovenkant van de week gescrolled.",
        "lists": [
          {
            "items": [
              "Accordion ingebouwd",
              "Optimalisatie non retina resolutie",
              "TODO: Automatisch naar volgende item of week via knop",
              "TODO: Labels/categoriën voor verschillende soorten items"
            ]
          }
        ]
      }
    ]
  },
  {
    "week": "5",
    "month": "oktober",
    "items": [
      {
        "date": "10 okt",
        "title": "Overview resultaten survey",
        "text": "Om de resultaten van de frontend developers goed in kaart te krijgen heb ik een overview gemaakt van de resultaten van specifiek de frontend developers.",
        "pdf": "/assets/pdf/week-5/overview-fe.pdf"
      },
      {
        "date": "11 okt",
        "title": "Gesprek Lucas Nutbey (Strateeg @ TamTam / Conceptueel begeleider)",
        "text": "Lucas heb ik benaderd voor mijn afstudeertraject als vraagbaken / begeleider op het conceptueel gebied. Omdat ik deze week volgens mijn roadmap in de concept fase beland heb ik een gesprek met hem ingepland. Lucas was wederom erg enthousiast over het idee en bevestigde dat ze ook bij de projectmanagers en strategen zoeken naar een oplossing voor dit probleem. Hoe kunnen we beter infromatie met elkaar opslaan en delen? Hij raadde me dan ook aan om me niet teveel vast te bijtelen op alleen de frontenders. In principe zou dit voor iedereen toegankelijk moeten zijn. Ook liet ik hem vragen zien zoals 'Hoe kan de oplossing integreren binnen de workflow van TamTam', hij vond dat ik me daar niet teveel mee bezig moest houden en me niet daardoor moest laten limiteren omdat dit een concept is wat bij elke digital agency of uberhaupt branche kan worden toegepast.",
        "lists": [
          {
            "items": [
              "Kijk naar de 4 D's, Discover / Define / Design / Deliver",
              "Momenteel in Define fase",
              "Weet wat mensen willen, weet waarom ze dat willen",
              "Vul customer value proposition & businessmodel canvas in",
              "Stap dan pas over naar concepting en design"
            ]
          }
        ]
      },
      {
        "date": "12 okt",
        "title": "Gesprek Jeroen Reumkens (Senior frontend developer @ TamTam / Technisch begeleider)",
        "text": "Jeroen is 3 weken op vakantie geweest, tijd voor een update! Na verteld te hebben wat ik de afgelopen weken heb gedaan hebben we het gehad over het uitwerken van het prototype. Ik had moeite met de deelvraag <strong>Wat voor framework is het beste geschikt om snel prototypes te maken</strong>. Ik zat te twijfelen of ik een nieuw framework moest kiezen, zoals React of Angular. Omdat ik maar kort de tijd heb zag ik dit als een risico, een nieuw framework leren in 6 weken tijd en vervolgens iets werkends krijgen is niet niks. We hebben het gehad over 'Frontend only' oplossingen. Dan zou meer echt een prototype worden en de boel gefaked zijn. Maar ik wil liever iets wat qua core functionaliteit echt werkt. Jeroen kwam aanzetten met <a href\"https://firebase.google.com\" target=\"_blank\">Firebase</a>. Firebase is een development platform wat, volgens Jeroen, op een erg fijne en makkelijke manier werkt.</br> Jeroen raadde aan om dit te gebruiken in combinatie met React. Er bestaan plugins en dergelijke die de samenwerking tussen React en Firebase erg simpel maakt. Daarnaast is React erg populair en een goede skill om te hebben. Hij heeft mij ervan overtuigd dat het juist nu tijdens het afstuderen een mooi moment is om een nieuw framework te leren. Een kans die je niet vaak meer zal krijgen. Daarom heb ik voor volgende week woensdag een mini bootcampje gepland met Jeroen. Hij gaat mij in 3 uur de basis van React uitleggen en helpen bij een eerste setup. Excitinggggggg!!!!"
      }
    ]
  },
  {
    "week": "6",
    "month": "oktober",
    "items": [
      {
        "date": "16 okt",
        "title": "Ecosysteem",
        "text": "Afgelopen vrijdag zijn we uiteten geweest met een aantal collega's. Waaronder m'n sparringspartner Lucas en favo collega Matt. We hebben het onderandere weer gehad over m'n afstudeerproject. Vanuit dit gesprek ben ik deze maandag begonnen met het uitdenken van het grotere plaatje. In principe staat de database met de content centraal in het midden. Deze moet worden kunnen aangevuld vanuit verschillende services zoals hipchat, slack en een browser extensie. Vervolgens moet alle content weer accesible zijn in een user interface op bijvoorbeeld een webapplicatie, native applicatie of in dezelfde browser extensie (nieuw tablad scherm). Zo kunnen de huidige services integreren binnen het ecosysteem en hoeven gebruikers zo min mogelijk extra applicaties te gebruiken",
        "images": [
          {
            "src": "/assets/images/week-6/ecosysteem.jpg"
          }
        ]
      },
      {
        "date": "17 okt",
        "title": "React course CodeCademy",
        "text": "Aangezien Jeroen mij aankomende woensdag avond een bootcamp React + Firebase gaat geven leek het mij verstandig om al enige voorkennis van React te hebben. Ik heb de course van Wes Bos aangeschaft: <a href=\"https://reactforbeginners.com/\" target=\"_blank\">React for beginners</a>, helaas kreeg ik niet meteen toegang tot deze cursus en moest ik wachten totdat de betaling via paypal was voltooid. Daarom ben ik maar begonnen met de gratis cursus van Codecademy, ook erg waardevol"
      },
      {
        "date": "18 okt",
        "title": "Browser extensie maken",
        "text": "Ik wilde kijken hoe moeilijk het is om een browserextensie te maken. Daarom ben ik de <a href=\"https://developer.chrome.com/extensions/getstarted\" target=\"_blank\">Getting Started: Building a Chrome Extension</a> gaan volgen. In principe is het niet moeilijk, het werkt hetzelfde als normale javascript, alleen dan met extra methods die bepaalde functies van chrome triggeren. Het is me gelukt om een custom \"nieuw tablad\" pagina te maken. Ik liep eigenlijk vast omdat ik nog niets met de firebase database kon doen. Maar in ieder geval ontdekt dat het geen zware magie is :D"
      },
      {
        "date": "18 okt",
        "title": "React + Firebase Bootcamp",
        "text": "Jeroen heeft mij een bootcamp React + Firebase gegeven zodat ik een begin setup had voor mijn project. Van 17:00 tot 21:00 heeft Jeroen mij de basics van React & Redux uitgelegd. Daarnaast hebben we een Firebase Database gekoppeld aan de applicatie. Het eindresultaat is een klein appje waarbij je items kan toevoegen. Het super toffe van React & Firebase is dat alles realtime gebeurd, zonder dat de pagina ook maar 1x geladen hoeft te worden",
        "images": [
          {
            "src": "/assets/images/week-6/react-firebase-demo.png"
          }
        ]
      }
    ]
  }
]