[
  {
    "anchor": "voorwoord",
    "chapter": "Voorwoord",
    "columnOne": "<p>De eindstreep is in zicht. Na vier jaar ontzettend te hebben genoten van de opleiding Communication &amp; Multimedia zitten mijn laatste twintig weken er op. Het begon allemaal met de Partners in Paars, een hechte groep die al snel naam hadden gemaakt bij alle andere kleurrijke groepen in het eerste jaar van de studie. Na in 2015 samen met Gijs en Victorine de zilveren SpinAward te hebben bemachtigd in de categorie Young Talent met het concept PLECK werd &eacute;&eacute;n ding duidelijk: ik wilde in staat zijn zelf te kunnen maken wat ik in mij opkomt. Vanuit die gedachte ben ik mij gaan verdiepen in Frontend Development. Vervolgens studeer je 3 jaar later af bij &eacute;&eacute;n van de meest gerenommeerde bedrijven van Nederland, het is allemaal snel gegaan.</p><p>In een periode van 20 weken is een concept neergezet met een technisch werkend prototype wat momenteel in gebruik is door de Frontend Developers van TamTam. Het ging uiteraard niet zonder slagen of stoten, maar ik ben trots op het resultaat. </p><p>Zonder een aantal mensen was mij dit niet gelukt. Daarom wil deze mensen bedanken voor hun hulp, inzet en steun de afgelopen paar maanden.</p>",
    "columnTwo": "<p><strong>Jeroen Reumkens</strong></p><p>Jeroen, wat een topper ben jij. Na een fijne tijd als stagiair met jou als buddy kon ik mij geen beter persoon voorstellen om mij te begeleiden vanuit TamTam dan jij. Altijd positief, enthousiast en behulpzaam. Ik wil je bedanken voor alle moeite en tijd die je hebt gestoken in het helpen en begeleiden van mij.</p><p><strong>Lucas Nutbey</strong></p><p>Lucas, de strateeg van TamTam. &ldquo;Niet luisteren naar wat school wilt, maar doen wat het beste is voor je product!&rdquo; zei jij altijd. Een wijze les. Bedankt voor de inzichten en het meedenken bij het concreet maken van het concept.</p><p><strong>CMD Squad</strong></p><p>Sinds de propedeuse vormen we al de drie musketiers. Christian, Pierre en Tom. Vanaf de eerste stageperiode is de Slack groep ontstaan waarin we elke dag dingen met elkaar delen. Soms wel meer dan met de collega&rsquo;s die naast je zitten. Als mensen aan mij vragen: &ldquo;heb jij nog vrienden overgehouden aan je studie?&rdquo;, dan zeg ik zekerste weten. Bedankt voor het meedenken en het bieden van een luisterend oor tijdens klaagbakens over hoe weinig zin ik er soms meer in had.</p><p><strong>Frontend Developers van TamTam</strong></p><p>Bedankt jongens en meisjes voor het geven van feedback, testen (lees: afbranden, geintje ;)) van m&rsquo;n prototype, en vooral het rellen. Ik heb er erg om gelachen. Zonder jullie zou het product waardeloos zijn. Geef jezelf een sticker.</p>"
  },
  {
    "anchor": "management-samenvatting",
    "chapter": "Management Samenvatting",
    "columnOne": "<p><strong>Introduction</strong></p><p>Het doel is dat een groep professionals een online centrale plek hebben waar zij online content over het vakgebied kunnen delen, opslaan, ontdekken en aanraden. </p><p>&nbsp;</p><p><strong>Claim</strong></p><p>Het online ecosysteem zorgt ervoor dat een groep professionals een platform heeft met relevante online content over het vakgebied waardoor collega&rsquo;s elkaar up to date houden over het vakgebied. </p><p>&nbsp;</p><p><strong>Topic</strong> </p><p>Ik heb onderzoek gedaan naar het delen van informatie over het vakgebied tussen collega&rsquo;s (Frontend Developers van TamTam) en hoe zij de gedeelde content opslaan om op een later moment terug te kijken. Hiermee heb ik in kaart gebracht wat voor methodes er gebruikt worden om te delen en op te slaan, wat de positieve en negatieve punten van deze methodes zijn en welke zaken echt missen. </p><p>&nbsp;</p><p><strong>The study</strong></p><p>Is de manier waarop groepen professionals inspiratie met elkaar delen over het vakgebied effici&euml;nt? Deze vraag komt voort uit een groter overkoepelend probleem: information overload. Er zijn veel artikelen, tutorials, websites die allerlei online content voorschotelen. Wat moet jij als professional bekijken? Hoe maak je de keuze wat voor jou relevant is? De content die collega&rsquo;s met elkaar delen is vaak relevant. Echter zijn de manieren waarop dit opgeslagen wordt niet effici&euml;nt. De links naar de online content verdwijnen in chat of mail feeds, waardoor het erg lastig is om deze op een later moment terug te vinden. </p>",
    "columnTwo": "<p><strong>Discussion</strong></p><p>De uitdaging die zich voordoet is om er voor te zorgen de information overload zich niet verplaatst naar het platform. Als artikelen op het platform gezet worden krijg je uiteindelijk ook een overload aan content. Om dit tegen te gaan wordt er gebruik gemaakt van zelf toegevoegde categorie&euml;n en filters. Daarnaast is er een recommandatie systeem toegevoegd om de relevantie van artikelen aan te tonen. Zo kunnen de gebruikers sneller beoordelen wat zij willen lezen. Bovendien zet het aan tot discussie. Een ander heikel punt is het toevoegen van de artikelen, de vraag is of gebruikers dat wel gaan doen. De drempel moet zo laag mogelijk gemaakt worden om zowel content toe te voegen als te beoordelen. Vanuit die gedachte is het ecosysteem opgezet. De huidige services die gebruikt worden delen automatisch de content via de API naar de database. Zo blijft de huidige manier van delen bestaan, het delen via Hipchat, en integreert het ecosysteem binnen de huidige werkflow (of beter gezegd, integreert de huidige werkflow binnen het ecosysteem). Een browser extensie detecteert wanneer een opgeslagen artikel wordt geopend in de browser en vraagt om het artikel te beoordelen. </p><p>&nbsp;</p><p><strong>Conclusion</strong></p><p>Door het gebruik van het ecosysteem gaat waardevolle online content niet verloren. Gebruikers kunnen terecht op het platform om content te vinden over het vakgebied. Content die gestructureerd geordend is en beoordeelt is op relevantie. Het is de plek waar mensen naar toe gaan om relevante online content over het vakgebied te ontdekken. </p>"
  },
  {
    "anchor": "inleiding",
    "chapter": "1. Inleiding",
    "columnOne": "<p>Dit afstudeerproject is het gevolg van een persoonlijk ondervonden probleem binnen de context van TamTam. Na het aankaarten van de bevindingen over het probleem en de mogelijkheden bij TamTam is mij de mogelijkheid gegund om hiervan mijn afstudeerproject te maken.</p></br><p><strong>Aanleiding</strong></p><p>De aanleiding van dit project komt door het persoonlijke gemis van een goede manier om vakinhoudelijke online content op te slaan. Door te kijken naar de manieren waarop andere hiermee omgingen werd vrij snel duidelijk dat meer mensen dit probleem ondervinden.</p></br><p><strong>TamTam</strong></p><p>TamTam is een full-service digital agency. Dit houdt in dat zij alles verzorgen op digitaal gebied en betrokken zijn bij het hele proces, vanaf de conceptuele fase tot het programmeren van het product. TamTam telt ongeveer 200 medewerkers en behoort daarmee tot een van de grootste van Nederland. TamTam is onderdeel van Dept, een netwerk van leading digital agencies. Dept bestaat op het moment van schrijven (januari, 2018) uit 12 bedrijven gevestigd in Europa en de US.</p><p>Voor meer informatie over <a href='http://www.tamtam.nl'>TamTam</a> en <a href='http://www.deptagency.com'>Dept</a> wijs ik u graag door naar de websites.</p></br><p>",
    "columnTwo": "<strong>Context &amp; Bigger picture</strong></p><p>Het idee voor dit concept is ontstaan vanuit persoonlijke behoefte. Na veel nadenken over dit concept is binnen TamTam (specifiek de groep frontend developers) hetzelfde probleem geconcludeerd. Daarmee is TamTam de eerste usecase van dit concept.</p><p>Gedurende het hele project is in het achterhoofd gehouden dat het concept niet specifiek bedoelt is voor de frontend developers van TamTam. De essentie van het idee zou voor allerlei groepen professionals een uitkomst bieden voor het probleem. De uitdaging binnen het traject lag dan ook in het continu bij elke keuze nadenken over het feit dat het ook voor andere doelgroepen zou moeten werken. Vanuit deze gedachte is een simpel idee uitgegroeid tot een complex overkoepelend systeem dat bedacht is om zo flexibel mogelijk te blijven en uit te kunnen groeien tot een product wat voor allerlei doelgroepen een oplossing kan bieden.</p><p>Een belangrijke doelstelling vanaf het begin van het afstudeer traject was om een werkend prototype neer te zetten wat getest kan worden in een specifieke context. Gezien deze doelstelling en het feit dat het concept vanaf de grond moest worden neergezet heeft de focus binnen dit project gelegen op het conceptuele vlak en de technische realisatie. Hierdoor is minder onderzoek gedaan naar design keuze&rsquo;s.</p><p>Het logboek is te bekijken op <a href='http://logboek.tomsnepvangers.com'>logboek.tomsnepvangers.com</a></p><p>Het prototype kan bekeken worden op <a href='http://prototype.tomsnepvangers.com'>prototype.tomsnepvangers.com</a></p>"
  },
  {
    "anchor": "probleemstelling",
    "chapter": "2. Probleemstelling",
    "subchapters": [
      {
        "anchor": "probleemstelling",
        "chapter": "2.1 Probleemschets",
        "text": "<p>Het vakgebied, web-development, ontwikkelt zich snel. Maandelijks komen nieuwe technieken uit, nieuwe frameworks op de markt en daarnaast wordt vooral ontzettend veel geschreven en besproken over alle ontwikkelingen.</p><p>Dit kan overweldigend zijn. Je wilt up to date blijven als developer, maar hoe doe je dit naast je fulltime job? The fear of missing out. Binnen het vakgebied ook wel &ldquo;Frontend Fatigue&rdquo; genoemd.</p><p>Hoe bepaal je als frontend developer wat relevant is voor jou en hoe bepalen frontend developers van TamTam wat relevant is voor hen om te lezen / bekijken en / of leren? Dat kan erg lastig zijn. Gelukkig heb je collega&rsquo;s, zij weten dit vaak wel.</p><p>De groep frontend developers van TamTam deelt veel met elkaar over hun expertise. Vaak is dit informatie die relevant is voor alle frontend developers van TamTam. De manier waarop dit opgeslagen en gedeeld wordt is echter niet effici&euml;nt. Links verdwijnen in de chat en Facebook groepen met het gevolg dat niet iedereen het ziet. Structuur is niet aanwezig in de chaos van alle informatie die wordt gedeeld.</p><p>Door de overload aan informatie die developers toekomt verliezen zij focus op wat zij willen of zouden moeten leren, lezen of bekijken. Dit is gebleken uit interviews met frontend developers van TamTam.</p><p>Het begrip information overload werd voor het eerst beschreven in 1964:</p><p><em>&ldquo;Information overload occurs when the amount of input to a system exceeds its processing capacity. Decision makers have fairly limited cognitive processing capacity. Consequently, when information overload occurs, it is likely that a reduction in decision quality will occur.&rdquo; -(Gross, 1964)</em></p><p>In de afbeelding naast staat de correlatie tussen de verschillende problemen.&nbsp;</p><p>Binnen de context van de situatie van de opdrachtgever zal de focus liggen tussen de eerste twee problemen. In feite helpen de frontend developers van TamTam elkaar al door relevante vakinhoudelijke inspiratie / kennis met elkaar te delen. Het probleem zit hem in de manier waarop. Omdat dit niet effici&euml;nt is, blijft het overkoepelende probleem bestaan: de overload aan informatie met als gevolg het Frontend Fatigue gevoel.</p>",
        "images": [
          {
            "src": "/assets/images/scriptie/probleem-correlatie.png",
            "caption": "Figuur 1. Correlatie tussen problemen"
          }
        ]
      },
      {
        "anchor": "design-challenge",
        "chapter": "2.2 Design Challenge",
        "type": "designchallenge",
        "fullwidth": true,
        "verticalCentered": true,
        "text": "<p>“Hoe kan een centraal platform ervoor zorgen dat de frontend developers van TamTam elkaar up to date houden en vakinhoudelijke content met elkaar kunnen delen zodat zij niet verdrinken in de overload aan beschikbare online content over het vakgebied“</p>"
      },
      {
        "anchor": "deelvragen",
        "chapter": "2.3 Deelvragen",
        "columnOne": "<h4>Conceptueel</h4><p><strong>Hoe kan structuur worden aangebracht in de chaos van alle gedeelde content?</strong></p><p>Om de information overload tegen te gaan moet er gekeken worden naar de manieren waarop er structuur kan worden aangebracht in grote hoeveelheden content. Vervolgens kan er onderzoek worden gedaan naar de design patterns van de mogelijke oplossingen. </p></br><p><strong>Hoe gaan developers in de huidige situatie om met informatie die gedeeld wordt? </strong></p><p>Inzichten in de manier waarop developers omgaan met de huidige situatie zijn erg belangrijk. Vanuit deze bevindingen wordt er gekeken naar de kansen en bedreigingen. </p></br><p><strong>Hoe kan de oplossing integreren in de bestaande werkflow en tools die momenteel worden gebruikt? </strong></p><p>Om er voor te zorgen dat developers zo min mogelijk tijd kwijt zijn aan het gebruiken van het product is het belangrijk dat deze kan integreren in de bestaande werkflow en tools die TamTam gebruikt. </p>",
        "columnTwo":"<h4>Prototyping</h4><strong>Wat is de beste techniek voor een het maken van een schaalbaar platform?</strong></p><p>Het is belangrijk dat het product schaalbaar is. Voor dit project is TamTam de use case. Echter, dit product zou in de toekomst in verschillende branches gebruikt kunnen worden. Om ervoor te zorgen dat de techniek achter het platform geschikt is om uit te breiden wordt er onderzoek gedaan naar de beste mogelijkheden. </p>"
      },
      {
        "anchor": "onderzoeksopzet",
        "chapter": "2.4 Onderzoeksopzet",
        "columnOne": "<h4>User Research</h4><ul><li>Orientend Expert Review</li><li>Survey</li></ul></br><h4>Good and Bad practices</h4><ul><li>Case Study</li><li>Benchmark Creation</li><li>Comparison Chart</li></ul></br><h4>User curated content</h4><ul><li>Literature Study</li><li>Desk Research</li><li>Expert Reviews</li></ul>",
        "columnTwo":"<h4> Concept &amp; design</h4><ul><li>Flowchart</li><li>Design Pattern Research</li><li>Literature Study</li><li>Schetsen</li></ul></br><h4>Prototyping</h4><ul><li>Desk Research</li><li>Prototyping</li><li>Expert Reviews</li></ul>"
      }
    ]
  },
  {
    "anchor": "user-research",
    "chapter": "3. User Research",
    "subchapters": [
      {
        "anchor": "user-research",
        "chapter": "Introductie",
        "text": "<p>Om een product te ontwikkelen wat aansluit op de behoeften van de gebruiker is het essentieel om doelgroep onderzoek te doen in het begin van het traject. Het is belangrijk om de kansen en struikelpunten inzichtelijk te maken. Inspelen op deze inzichten maakt een product waarde- en succesvol.</p>"
      },
      {
        "anchor": "doelgroep",
        "chapter": "3.1 Doelgroep",
        "text": "<p>Er is tijdens het gehele traject in het achterhoofd gehouden dat dit concept niet gelimiteerd is tot TamTam. De groep frontend developers van TamTam is de use case voor dit traject, hier is immers het idee voor het product ontstaan.</p></br></br><p>De frontend developers van TamTam is een enthousiaste groep professionals die uitermate gepassioneerd zijn over hun vakgebied. Binnen deze groep wordt veel gepraat, gediscussieerd en gedeeld over het vakgebied. Dit gebeurd zowel online als offline. Van de online kanalen is Hipchat veruit de meest gebruikte. Hipchat is een soortgelijke applicatie als Slack: een chat applicatie.</p>",
        "images": [
          {
            "src": "../assets/images/scriptie/office.jpg",
            "caption": "Figuur 2: Amsterdam Office"
          }
        ]
      },
      {
        "anchor": "orienting-expert-reviews",
        "chapter": "3.2 Orienting Expert Reviews",
        "text": "<p>Het begin van het onderzoek is gestart met Orienting Expert Reviews. Door middel van het gesprek aan te gaan met developers is de hypothese dat zij het gevoel van information overload ervaren bevestigd. Vanuit de bevindingen van deze gesprekken zijn de vragen voor een survey uitgezet om meer concrete informatie over het gedrag van de doelgroep te bemachtigen.</p></br></br>De survey en samenvatting van de bevindingen zijn te bekijken in <a href='https://logboek.tomsnepvangers.com' target='_blank'>week 2 van het logboek.</a>"
      },
      {
        "anchor": "survey",
        "chapter": "3.3 Survey",
        "text": "<p>Om inzichten te krijgen in de huidige situatie is een survey afgenomen onder de developers. De online enquete is bewust verstuurd naar alle developers (frontend, backend, devops) van TamTam met de gedachte in het achterhoofd dat het product niet per se te specifiek op maat gemaakt moet worden voor &eacute;&eacute;n doelgroep. Daarnaast kunnen inzichten vanuit andere hoeken waardevol zijn.</p><p>De hoofdvraag van de survey luid: </p><p><strong><em>Wat missen developers tijdens het opslaan / delen van vakinhoudelijke content ?</em></strong></p></br><p>In de survey wordt gevraagd naar een aantal factoren gerelateerd aan het delen en opslaan van online content over het vakgebied. Hoe zij dit doen en of zij tevreden zijn met de manier waarop zij dit doen. Daarnaast zijn een aantal vragen voorgeschoteld die inzicht geven in de frequentie, plaats en tijd gerelateerd aan het consumeren van de online content. Deze inzichten zijn waardevol voor de concept fase. </p><p>De survey en samenvatting van de bevindingen zijn te bekijken in <a href='http://logboek.tomsnepvangers.com' target='_blank'>week 4 &amp; 5 van het logboek</a></p>"
      },
      {
        "anchor": "bevindingen",
        "chapter": "3.4 Bevindingen",
        "columnOne": "<p>De belangrijkste bevinden vanuit het doelgroep onderzoek zijn hieronder per kopje beschreven.</p><p>&nbsp;</p><p><strong>Information overload</strong></p><p>Het gevoel van information overload wordt ervaren door de doelgroep. Het vakgebied ontwikkeld zich snel, daarnaast is het vakgebied uitgebreid en kan je erg diep in gaan op veel topics. In feite helpen collega&rsquo;s elkaar al bij dit probleem, zij delen relevante online content met elkaar. Hierdoor wordt het voor developers enigszins makkelijker om een keuze te maken in wat zij willen bekijken.</p><p><strong>Content opslaan</strong></p><p>91,7% van de respondenten geeft aan content op te slaan om op een later tijdstip te bekijken. De meest voorkomende manier om deze content op te slaan zijn browser bookmarks. Daarnaast worden notitie diensten zoals Evernote, Google Keep veel gebruikt en Pocket.</p><p>De meningen over de meest gebruikte manier van content opslaan, bookmarks, vat het probleem in notendop samen: Het is fijn dat alles op een centrale plek staat, maar het wordt ontzettend snel onoverzichtelijk.</p><p>Een ander opvallende reactie die meerdere keren terugkomt is het feit dat de huidige manier van opslaan als &lsquo;ok&eacute;&rsquo; wordt ervaren omdat er geen alternatief is. Hieruit valt te concluderen dat er op dit gebied kansen liggen om de gebruikerservaring te verbeteren.</p><p><strong>Content delen</strong></p><p>Hipchat is onder de frontend developers veruit de meest gebruikte tool om content te delen.</p><p>Op de vraag wat zij vinden van deze manier van delen reageren velen met de opmerking dat de content snel verdwijnt in de chat feed.</p><p>Het is opvallend dat Hipchat veel minder (80% vs 36%) wordt genoemd onder de andere developers (backend / devops). De &ldquo;andere&rdquo; developers benoemen voornamelijk Whatsapp, email en face to face gesprekken.</p><p>Onder zowel backend als frontend worden dezelfde problemen ondervonden bij de digitale manieren om content te delen:</p>",
        "columnTwo": "<p>Methode: <strong>Mail</strong></p><p>Rol: <strong>Backend developer</strong></p><p>&ldquo;<em>its okay i guess, would be nice to have an archive of some sorts with filters&rdquo;</em></p><p>&nbsp;</p><p>Methode: <strong>Hipchat </strong></p><p>Rol: <strong>Frontend developer</strong></p><p><em>&ldquo;It does not work because it is hard to find back articles if you need them again&ldquo;</em></p><p>&nbsp;</p><p>Methode: <strong>Mail&nbsp; / Workspace (Facebook for work)</strong></p><p>Rol: <strong>Backend developer</strong></p><p>&ldquo;<em>Not the best approach as eventually you'll forget about them and won't be able to find them when you need the articles/examples&rdquo;</em></p><p>&nbsp;</p><p>Methode: <strong>Hipchat </strong></p><p>Rol: <strong>Frontend developer</strong></p><p><em>&ldquo;I can't reach everyone. Especially when I share via chat, it disappears in all the other discussions going on in the chat.&rdquo;</em></p><p>&nbsp;</p><p><strong>Frequentie, plaats en tijd</strong></p><p>50% van de frontend developers bekijkt dagelijks online content over het vakgebied. De andere 50% doet dit minstens wekelijks. De plaats en tijdstippen waarop online content wordt genuttigd is voornamelijk willekeurig. Deze willekeurigheid komt voornamelijk voort uit het feit dat veel developers moeten wachten op bepaalde processen tijdens het ontwikkelen van websites.</p>"
      },
      {
        "anchor": "persona",
        "chapter": "3.5 Persona",
        "columnOne": "<p>Vanuit de bevindingen van het gedane onderzoek is een persona samengesteld. Er is gekozen voor een persona met de focus op het gedrag: <em>a Behavioral Persona</em> (Bartel, 2016). Deze vorm van een persona is bedoelt voor situaties waarin de doelgroep specifiek en bekend is. In het geval van dit onderzoek is de doelgroep bekend en erg specifiek, Frontend Developer collega&rsquo;s. </p><p>&nbsp;</p><p>Binnen het persona is gekeken naar de twee belangrijkste aspecten van het gedrag in het kader van dit onderzoek: het delen en opslaan van de online content.</p>",
        "persona": true
      },
      {
        "anchor": "user-research-conclusie",
        "chapter": "3.6 Conclusie",
        "text": "<p>De doelgroep helpt elkaar een keuze te maken in de beschikbare online content over het vakgebied door stukken te delen met elkaar. Dit gaat het gevoel van information overload tegen doordat er relevante content wordt aangeboden door collega&rsquo;s.</p><p>De tools die hier momenteel voor gebruikt worden voldoen niet geheel aan de behoeftes van de doelgroep. Enerzijds is Hipchat een makkelijke tool om mee te delen. Elke Frontend Developer zit in de Frontend groep chat. Dit is een levendige chatgroep waarin veel wordt gecommuniceerd. Anderzijds is dit een applicatie welke bedoelt is als chat applicatie, niet voor het delen van online content. De links die hierin gedeeld worden verdwijnen snel in de chat feed. Hierdoor missen veel developers de content die gedeeld wordt in de chat groep.</p><p>De manieren waarop de developers (zowel backend als frontend) dit probleem momenteel proberen te tackelen werkt niet effici&euml;nt. Hipchat, e-mails en Whatsapp, overal komt hetzelfde probleem naar boven:</p><p><strong>Het terug vinden van gedeelde content op een later tijdstip is niet tot nauwelijks mogelijk.</strong></p><p>Sommige developers gebruiken bepaalde tools om de gedeelde online content op te slaan. Bij de twee meest voorkomende manieren (bookmarks en notitie apps) wordt het overzicht snel verloren, daarnaast vergt dit elke keer tijd om bij te houden. </p><p>Het is belangrijk om in het achterhoofd te houden dat de doelgroep al veel tools gebruiken. De drempel ligt hoog om nog meer extra tools te moeten gebruiken.</p>"
      }
    ]
  },
  {
    "anchor": "good-and-bad-practices",
    "chapter": "4. Good and Bad Practices",
    "subchapters": [
      {
        "anchor": "good-and-bad-practices",
        "chapter": "Introductie",
        "text": "<p>De doelgroep gebruikt momenteel allerlei tools om content op te slaan en te delen. Dit is niets nieuws. Het is van belang om te onderzoeken wat voor tools er bestaan. Hierdoor wordt de kans op het opnieuw uitvinden van het wiel vermeden. Vanuit de inzichten over de huidige tools kunnen de do’s en don’ts in kaart worden gebracht. </p>"
      },
      {
        "anchor": "benchmark-creation",
        "chapter": "4.2 Benchmark Creation",
        "text": "<p>Er zijn vanuit het gebruikersonderzoek een aantal verschillende oplossingen voor het probleem naar boven gekomen. Zo gebruiken veel developers bijvoorbeeld notitie apps om online content op te slaan. Omdat er eigenlijk meerdere soorten applicaties worden gebruikt voor twee verschillende doeleinden, delen en opslaan, is er een Benchmark Creation gemaakt om de verschillende manier te clusteren en zo inzichtelijk te maken. </p><p>&nbsp;</p><p>De volledige Benchmark Creation is terug te vinden in het logboek in <a href='http://logboek.tomsnepvangers.com' target='_blank'>week 4</a>.</p>"
      },
      {
        "anchor": "comparison-chart",
        "chapter": "4.3 Comparison Chart",
        "text": "<p>Om de verschillen tussen de applicaties in kaart te brengen is een Comparison Chart gebaseerd op een aantal functies. Deze functies zijn samengesteld na het scannen van de applicaties die in de benchmark opgedeeld zijn. De applicaties die in geen enkele zin bedoelt zijn om content op te slaan zijn achterwege gelaten. De functies zijn: </p><p>&nbsp;</p><ul><li>Categorisatie mogelijkheden</li><li>Tag / Label mogelijkheden</li><li>Browser extensie</li><li>Mogelijkheid om zelf categorie&euml;n aan te maken</li><li>Snel opslaan</li><li>Prioriteitssysteem&nbsp;</li><li>Mogelijkheid om groepen aan te maken</li></ul><p>&nbsp;</p><p>In de Comparison Chart is te zien dat Evernote de meeste functionaliteiten bevat. De gedeelde tweede plaats is voor Google Keep, Dropmark. Daarna volgt Pocket. Deze vier applicaties en hun functies zijn nader onderzocht in de Case Study.</p>",
        "images": [
          {
            "src": "../assets/images/scriptie/comparison-chart.png",
            "caption": "Figuur 3. Comparison Chart - Saving & Sharing functionaliteit"
          }
        ]
      },
      {
        "anchor": "evernote",
        "chapter": "4.3.1 Evernote",
        "text": "<p>Evernote is een van de populairste notitie apps op de markt. Door de cross-platform integratie hebben gebruikers op elk device toegang tot hun notities. </p><p>&nbsp;</p><p>Evernote is een fijne notitie app. Het bevat veel functies waarmee uitgebreide notities kunnen worden gemaakt. Daarentegen is en blijft het een notitie app. Binnen het kader van veel online content opslaan is het een te chaotische interface. De optie om notes te prioriteren is niet aanwezig.</p><p>&nbsp;</p><p>De manier van content opslaan is uitgebreid. De browser extensie van Evernote bevat een aantal mogelijkheden om complete online artikelen op te slaan in een notitie. Er kunnen tijdens het opslaan meteen tags worden toegevoegd.</p><p>&nbsp;</p><p>Evernote werkt goed waar het voor bedoelt is: notities. Voor het opslaan van veel online content werkt het niet lekker.</p><p>&nbsp;</p><p><strong>+ uitgebreide browser extensie</strong></p><p>&nbsp;</p><p><strong>- user interface is vrij ingewikkeld, je moet hier echt aan wennen</strong></p><p><strong>- geen prioritering mogelijkheden</strong></p>",
        "images": [
          {
            "src": "../assets/images/scriptie/evernote.png",
            "caption": "Figuur 4. Evernote Desktop Applicatie"
          }
        ]
      },
      {
        "anchor": "pocket",
        "chapter": "4.3.2 Pocket",
        "text": "<p>Pocket is een bookmark saver. Door middel van Pocket kunnen links makkelijk opgeslagen en op een centrale plek beheerd worden. </p><p>&nbsp;</p><p>De browser extensie van pocket is een plus. De manier waarop de feed wordt weergegeven is echter veel te beperkt. Uiteindelijk zijn het in principe bookmarks weergegeven in een user interface. De hoofd feed (My List) is alsnog een lange lijst met volgestopt met artikelen. Binnen deze lijst is het niet mogelijk om de manier waarop deze worden gesorteerd te wijzigen.</p><p>&nbsp;</p><p>Het tag systeem functioneert prima, afgezien van het feit dat je losse pagina&rsquo;s hebt voor elke tag. </p><p>&nbsp;</p><p><strong>+ De meeste items hebben geautomatiseerde thumbnails, hierdoor is het visueel sneller duidelijk waar het item over gaat.</strong></p><p><strong>+ De gebruiker kan zelf switchen tussen lijst of grid weergave</strong></p><p><strong>+ Browser extensie werkt snel</strong></p><p><strong>+ Meteen tags toevoegen via browser extensie</strong></p><p>&nbsp;</p><p><strong>- Geen invloed op de sortering van de feed </strong></p><p><strong>- Er is geen categorie systeem aanwezig</strong></p><p><strong>- Tags overzicht staan op losse pagina&rsquo;s</strong></p>",
        "images": [
          {
            "src": "../assets/images/scriptie/pocket.png",
            "caption": "Figuur 5. Pocket User Interface"
          }
        ]
      },
      {
        "anchor": "google-keep",
        "chapter": "4.3.3 Google Keep",
        "text": "<p>Google Keep heeft mooi design, werkt snel, maar is duidelijk gefocust op het opslaan van notities. Hierdoor is de flow soms niet optimaal als het gaat om het opslaan van online content. </p><p>&nbsp;</p><p>De weergave van de items zijn duidelijk. Het is mogelijk om labels en kleuren toe te voegen. Hierdoor wordt het makkelijk om visueel onderscheid te maken tussen verschillende items.</p><p>&nbsp;</p><p> Wat mist is de mogelijkheid om de weergave van de lijst te filteren. Deze staat standaard ingesteld op chronologische volgorde. De herinneringen functionaliteit is een topper. Hiermee kan een herinnering worden ingesteld voor een notitie die gesynchroniseerd wordt met Google Calendar.</p><p>&nbsp;</p><p><strong>+ Design</strong></p><p><strong>+ Herinneringen</strong></p><p><strong>+ Vast pinnen van belangrijke items</strong></p><p><strong>+ &ldquo;Voeg nieuwe notitie toe&rdquo; prominent aanwezig</strong></p><p><strong>+ Items labelen met kleuren</strong></p><p>&nbsp;</p><p><strong>- Geen mogelijkheid tot ordenen van de hoofd feed</strong></p><p><strong>- Gericht op het opslaan van notities</strong></p>",
        "images": [
          {
            "src": "../assets/images/scriptie/google-keep.png",
            "caption": "Figuur 6 Google Keep User Interface"
          }
        ]
      },
      {
        "anchor": "dropmark",
        "chapter": "4.3.4 Dropmark",
        "text": "<p>Dropmark is een handige tool om links, bestanden en notities te verzamelen in visuele collecties. </p><p>&nbsp;</p><p>Het toevoegen van collecties is vergelijkbaar met de andere applicaties: een browser extensie en formulier in de webapplicatie. </p><p>&nbsp;</p><p>Dropmark springt eruit met de integratie van Slack. Dit is een dikke plus ten opzichte van de andere applicaties. Hieraan is te zien dat Dropmark gericht is op groepen gebruikers. Een minpunt is dat Dropmark eigenlijk een betaalde applicatie is, zonder aanschaffen van het Pro plan zijn veel functies niet beschikbaar.</p><p>&nbsp;</p><p><strong>+ Integratie met Slack</strong></p><p><strong>+ Veel aandacht voor teams</strong></p><p>&nbsp;</p><p><strong>- Nagenoeg nutteloos zonder Pro versie</strong></p><p><strong>- Geen overview van alle items</strong></p>",
        "images": [
          {
            "src": "../assets/images/scriptie/dropmark.jpg",
            "caption": "Figuur 6 Dropmark User Interface"
          }
        ]
      },
      {
        "anchor": "good-and-bad-practices-conclusie",
        "chapter": "4.4 Conclusie",
        "text": "<p>Er zijn veel applicaties die gebruikt worden om online content op te slaan en te delen. De meest gebruikte soort applicatie is de notitie app. Het nadeel van notitie apps is dat deze niet specifiek bedoelt zijn voor het opslaan van links. Hierdoor ontstaat snel dezelfde situatie als bij de bookmarks: &eacute;&eacute;n of meerdere notities met een lijst van links. Het overzicht is hierdoor ver te zoeken.</p><p>&nbsp;</p><p>Het toevoegen van items via een browser extensie is een zeer waardevolle toevoeging aan alle onderzochte applicaties. Het gebruik van een browser extensie verlaagd de drempel om items toe te voegen. Het zo laag mogelijk maken van deze drempel is erg belangrijk voor de doelgroep omdat zij zo min mogelijk tijd willen besteden aan de handeling om items toe te voegen. </p><p>&nbsp;</p><p>De integratie met andere systemen zorgt ook voor een drempelverlagend effect. De manier waarop Slack integreert met Dropmark is hier een goed voorbeeld van. Helaas ondersteunen zij geen Hipchat. Wanneer Dropmark dit mogelijk in de toekomst toevoegt als optie is het wellicht interessant om te kijken naar de mogelijkheden om Dropmark te gebruiken.</p>"
      }
    ]
  },
  {
    "anchor": "job-stories",
    "chapter": "5. Job Stories",
    "subchapters": [
      {
        "anchor": "job-stories",
        "chapter": "Introductie",
        "text": "<p>Vanuit de inzichten in de behoeftes en wensen van de gebruiker zijn een aantal Job Stories opgezet. Door middel van een Job Story wordt een design probleem of challenge in een Job, oftewel taak, gekaderd. De reden om Job Stories in plaats van User Stories te gebruiken is het feit dat Job Stories minder ruimte laten voor aannames (Klement, 2013).</p><p>&nbsp;</p><p>Job Stories bestaan uit een situatie, motivatie en verwachte uitkomst:</p><p>&nbsp;</p><p>When _____ , I want to _____ , so I can _____ .</p><p>&nbsp;</p><p>Omdat de gebruiker zowel persoonlijke als teamverband hebbende belangen heeft zijn er Job Stories als individu en groepsverband gemaakt.</p>"
      },
      {
        "anchor": "individuen",
        "chapter": "5.1 Individuen",
        "text": "<p><em>Wanneer ik een artikel tegenkom dat ik interessant vind wil ik dit snel opslaan zodat ik dit later terug kan bekijken.</em></p><p>&nbsp;</p><p><em>Wanneer ik artikelen heb opgeslagen wil ik dat deze gestructureerd worden weergegeven zodat ik het overzicht houd over mijn opgeslagen artikelen.</em></p><p>&nbsp;</p><p><em>Wanneer ik nieuws over mijn vakgebied wil lezen wil ik online content voorgeschoteld krijgen die voor mij relevant is zodat ik mij geen zorgen hoef te maken over wat ik moet kiezen om te lezen / bekijken.</em></p>"
      },
      {
        "anchor": "groepen",
        "chapter": "5.2 Groepen",
        "text": "<p><em>Wanneer een groepslid relevante online content tegenkomt wilt hij dit delen met de groep zodat iedereen dit leest en weet. </em></p><p>&nbsp;</p><p><em>Wanneer een groepslid op het platform kijkt naar de gedeelde artikelen wilt hij weten welke artikelen aangeraden worden door mede collega&rsquo;s zodat hij makkelijk kan bepalen welke artikelen hij wilt lezen en geen overload aan information ervaart.</em></p><p>&nbsp;</p><p><em>Wanneer een groep online content met elkaar deelt willen zij zelf de categorie&euml;n / labels bepalen zodat zij zelf de gewenste structuur kunnen aanbrengen in alle beschikbare content.</em></p><p>&nbsp;</p><p><em>Wanneer een groepslid het platform bezoekt wilt hij een duidelijk overzicht hebben van de beschikbare content zodat hij niet verdrinkt in alle beschikbare content.</em></p><p>&nbsp;</p><p><em>Wanneer ik een artikel heb gelezen wil ik mijn mening daarover geven zodat ik collega&rsquo;s kan laten inzien wat ik er van vind.</em></p>"
      }
    ]
  },
  {
    "anchor": "concept",
    "chapter": "6. Concept",
    "subchapters": [
      {
        "anchor": "concept",
        "chapter": "Introductie",
        "columnOne": "<p>Met de opgezette Job Stories, de vergaarde informatie over de bestaande oplossingen en inzichten in de behoeften en wensen van de doelgroep is een concept opgezet.</p><p>Tijdens de conceptuele fase is gekeken naar een drietal hoofdpunten:</p><ul><li>Schaalbaarheid</li><li>Motivatie om de gebruiker content te laten delen en beoordelen</li><li>Tegen gaan van Information overload</li></ul><p>&nbsp;</p><p>De schaalbaarheid is belangrijk omdat er tijdens het gehele proces rekening is gehouden met het feit dat het concept mogelijk een oplossing is voor meerdere branches. Daarnaast is het specifiek voor TamTam belangrijk dat het concept integreert binnen de huidige tools en workflow.</p>",
        "columnTwo": "<p>De gebruikers moeten gemotiveerd worden om content te delen en te beoordelen op het platform. De beoordeling is een essentieel onderdeel om meer van het platform te maken dan alleen een databank. Om dit gedrag te bewerkstelligen is onderzoek gedaan naar hoe gebruikers gemotiveerd raken om bepaalde handelingen te verrichten.</p><p>&nbsp;</p><p>Om het onderliggende probleem tegen te gaan is gekeken naar oplossingen voor het information overload probleem.</p>"
      },
      {
        "anchor": "online-ecosysteem",
        "chapter": "6.2 Online ecosysteem",
        "text": "<p>De kern van het concept is een online ecosysteem waarop allerlei services die de doelgroep momenteel gebruikt kunnen worden aangesloten. Hierdoor kunnen de gebruikers hun huidige tools blijven gebruiken en hoeft er zo min mogelijk veranderd te worden aan de gehanteerde werkwijze van het delen van online content.</p>",
        "images": [
          {
            "src": "../assets/images/scriptie/ecosystem.png",
            "caption": "Figuur 8. De onderdelen van het ecosysteem"
          }
        ]
      },
      {
        "anchor": "suppliers-and-distributors",
        "chapter": "6.1.1 Suppliers & Distributors",
        "text": "<p>Het ecosysteem bestaat uit &ldquo;Suppliers&rdquo; en &ldquo;Distributors&rdquo;. De namen spreken voor zich: de Suppliers zorgen ervoor dat de content in de database terecht komt, de Distributors zijn de kanalen die de opgeslagen content weergeven door middel van een user interface. Binnen de context van de huidige doelgroep zijn Hipchat en de browser extensie uitgelicht. Een zogenaamde &ldquo;bot&rdquo; (geautomatiseerd script dat acties kan ondernemen bij bepaalde gebruikers input) vraagt bij elke gedeelde link of deze toegevoegd zou moeten worden op het platform. De gebruikers hoeven op deze manier hun manier van delen niet te veranderen. De browser extensie is een must have om een artikel on the fly te delen. Wanneer online content wordt bezocht kan dit binnen enkele seconden via een toetsen combinatie toegevoegd worden aan de database.</p>"
      },
      {
        "anchor": "api",
        "chapter": "6.1.2 API: Schaalbaarheid",
        "text": "<p>Zowel de Suppliers als Distributors &ldquo;praten&rdquo; met een API welke op zijn beurt weer in connectie staat met de database. Door middel van de API is het voor elke service of applicatie mogelijk om aan te sluiten op het ecosysteem om zowel online content items toe te voegen als uit te lezen. Dit gegeven maakt het concept schaalbaar en makkelijk integreerbaar binnen huidige workflows en tools.</p>"
      },
      {
        "anchor": "uitwerking",
        "chapter": "6.1.3 Uitwerking",
        "columnOne": "<p>Gezien de korte tijdsperiode om een prototype uit te werken is het niet mogelijk om het gehele ecosysteem uit te werken. Er is gekozen om voor het prototype de user interface met database te bouwen in de vorm van een web applicatie. Bij het kiezen van de techniek voor het bouwen van dit deel is echter wel rekening gehouden met de schaalbaarheid.</p><p>Het prototype is gemaakt met React, Redux en Firebase. De combinatie is bewust gekozen omdat hiermee snel een prototype neergezet kan worden. React is een van de meest populaire frameworks van dit moment. Daarnaast kan met React ook native applicaties gemaakt worden (React Native). Dit maakt het de perfecte keuze voor een schaalbaar platform. Firebase is een &ldquo;Mobile Application Development&rdquo; platform waarmee er snel een database kan worden opgezet zonder dat hier enige backend kennis voor vereist is. Dit maakt het mogelijk om een prototype te bouwen dat daadwerkelijk werkt met alleen frontend development kennis. Daarnaast zorgt de combinatie van React, Redux en Firebase ervoor dat alle data realtime kan worden ge&uuml;pdatet. </p><p>&nbsp;</p>",
        "columnTwo": "<p>Meer informatie over het gedane onderzoek over de techniek is te vinden in het logboek in <a href='http://logboek.tomsnepvangers.com'>week 5</a></p>"
      },
      {
        "anchor": "systematische-weergave",
        "chapter": "6.1.4 Systematische weergave",
        "text": "<p>Door middel van een systematische weergave is de werking van het totale ecosysteem samen gevat. Het deel dat uitgewerkt is in het prototype is in het oranje omcirkeld.</p>",
        "imagesFullWidth": true,
        "images": [
          {
            "src": "../assets/images/scriptie/systematical-scheme.jpg",
            "caption": "Figuur 9. Systematische weergave van het ecosysteem"
          }
        ]
      },
      {
        "anchor": "stucturing-information",
        "chapter": "6.2 Structuring Information",
        "text": "<p>Information overload is het onderliggende probleem dat getackeld moet worden. Het is belangrijk dat het gevoel van information overload zich niet verplaatst naar de user interface van de Distributors. Om dit te voorkomen is onderzoek gedaan naar het voorkomen van information overload en een Design Pattern Research gedaan naar categorisatie, tags en rating. </p>"
      },
      {
        "anchor": "het-voorkomen-van-information-overload",
        "chapter": "6.2.1 Het voorkomen van information overload",
        "text": "<p>De informatie die in de database van het ecosysteem terecht komt is als het ware al gefilterde data door de groep gebruikers. Desondanks kan deze data doorgroeien tot een hoeveelheid dat opnieuw information overload kan veroorzaken.</p><p>Het is belang dat het systeem aanpasbaar is. Individuen leren om grote hoeveelheden communicatie en content zelf te organiseren (Hiltz, 1985). Echter hebben verschillende individuen verschillende voorkeuren en behoeften.</p><p>De succesfactor van de werking van een systeem binnen een organisatie hangt af van de mate waarin het systeem is afgestemd op de behoeften van de gebruiker (Hiltz, 1985).</p><p>&nbsp;</p><p>De onderzochte stukken zijn terug te vinden in <a href='http://logboek.tomsnepvangers.com' target='_blank'>week 8 van het logboek</a></p>"
      },
      {
        "anchor": "categorisatie-tags-rating",
        "chapter": "6.2.2 Categorisatie, tags en rating",
        "columnOne": "<p><strong>Categorie&euml;n en tags</strong></p><p>Binnen grote hoeveelheden informatie wordt structuur aangebracht door middel van categorisatie. Categorie&euml;n worden ingezet om een bredere overkoepelende overeenkomst aan te geven. Binnen de user interface van het platform worden tags gebruikt om meer specificiteit te geven aan items binnen de categorie&euml;n. Als het ware fungeren tags als sub categorie&euml;n. Vanwege het visuele verschil worden ze tags genoemd. </p><p>De categorie&euml;n en tags kunnen worden aangemaakt door gebruikers. Binnen het in gebruik nemen van het platform zal worden gewaarschuwd om niet in het wilde weg allerlei categorie&euml;n en tags aan te maken. Zoals in het vorige hoofdstuk beschreven is het belangrijk dat de groep gebruikers zelf de mogelijkheid hebben om categorie&euml;n en tags toe te voegen. Hier komt echter wel een stukje verantwoordelijkheid bij kijken. Een groep professionals die het platform in gebruik neemt is zelf verantwoordelijk voor het behoeden van teveel categorie&euml;n en tags. Uiteraard kunnen tags en categorie&euml;n verwijdert worden.&nbsp;</p>",
        "columnTwo": "<p><strong>Rating</strong></p><p>De content op het platform is een kleine selectie van alle online content die online te vinden is. Deze selectie is samengesteld door collega&rsquo;s. Om de keuze nog verder te versimpelen en de relevantie nog verder te vergroten kunnen items beoordeeld worden.</p><p>Tijdens het onderzoek is gekeken naar traditionele vormen van beoordeling: up voting (plust en min) &amp; rating (bijv. 5 sterren). Het wordt echter afgeraden om deze vormen van beoordeling te gebruiken bij kleine groepen gebruikers (UI-patterns). Daarnaast is het doel van de rating het uitdrukken van het gevoel wat gebruikers hebben bij een artikel. Emojis zijn hiervoor een geschikte oplossing. Facebook is hier een goed voorbeeld van. De &ldquo;Reactions&rdquo; van Facebook zijn in het leven geroepen om gebruikers meer mogelijkheden te geven om hun gevoel te uiten (Teehan, 2016).</p><p>Gedeelde items kunnen beoordeeld worden door middel van emojis in twee categorie&euml;n. De &lsquo;This item rocks&rsquo; (positief) en de &lsquo;Food For Thought&rsquo; (discussie waardig). Uit onderzoek is gebleken dat de interpretatie van emojis context afhankelijk is. Daarom kan de groep gebruikers zelf emojis instellen bij de positieve en negatieve beoordeling. Voor TamTam zijn 🤘en 🤔 gebruikt omdat deze voor de meest hand liggend zijn en positieve reacties omhoog brachten in het onderzoek.</p><p>&nbsp;</p><p>De volledige design pattern research documenten over categorisatie, tagging en rating zijn terug te vinden in <a href='http://logboek.tomsnepvangers.com' target='_blank'>week 8 van het logboek.</a></p>",
        "images": [
          {
            "src": "../assets/images/scriptie/item-cards.png",
            "caption": "Figuur 10. Prototype V1: Item cards"
          }
        ]
      },
      {
        "anchor": "wireframe",
        "chapter": "6.3 Wireframe",
        "text": "<p>In het wireframe komen de bevindingen van het structureren van informatie samen tot een plat ontwerp. Zoals eerder vermeld is in dit project de focus voornamelijk op het conceptuele en technische vlak gelegd.</p>",
        "imagesFullWidth": true,
        "images": [
          {
            "src": "../assets/images/scriptie/wireframe.png",
            "caption": "Figuur 11. Wireframe V1: user interface web applicatie"
          }
        ]
      },
      {
        "anchor": "user-curated-content",
        "chapter": "6.4 User Curated Content",
        "columnOne": "<p>De content van het platform bestaat uit een verzameling van online content geselecteerd en beoordeeld door de gebruikers van het platform. Collega&rsquo;s bieden elkaar relevante content aan. Dit principe heet user curated content.</p><p>Ervoor zorgen dat gebruikers daadwerkelijk items beoordelen is een uitdaging. Het is van belang dat de gebruiker wordt begrepen.</p><p>Dr. BJ Fogg heeft een model ontwikkeld genaamd het Fogg Behavior Model. Dit model bevat een drietal factoren die in balans moeten zijn om het gewenste gedrag te doen ontstaan. </p><p>Deze drie factoren zijn motivation, ability en trigger.</p>",
        "columnTwo": "<p>In figuur 12 is de samenhang van de drie factoren te zien. Om ervoor te zorgen dat de gebruiker een bepaald handeling onderneemt moet de motivatie en de ability (gemakkelijkheid) allebei hoog zijn.</p>",
        "images": [
          {
            "src": "../assets/images/scriptie/fogg-1.jpg",
            "caption": "Figuur 12. Fogg Behaviour Model"
          },
          {
            "src": "../assets/images/scriptie/fogg-2.jpg",
            "caption": "Figuur 12. Fogg Behaviour Model"
          }
        ]
      },
      {
        "anchor": "motivation",
        "chapter": "6.4.1 Motivation",
        "columnOne": "<p>Grip krijgen op de motivatie van mensen is erg lastig. Het is iets wat vanuit de mens zelf komt en soms moeilijk om te activeren. Motivatie wordt beschreven als &lsquo;gedreven worden om iets te doen&rsquo; door Ryan &amp; Deci (2000).</p><p>Motivatie kan onderverdeeld worden in intrinsieke en extrinsieke motivatie (Zimbardo, 2007). Intrinsiek motivatie betekent dat de wil om iets te doen van binnenuit komt. De gebruiker haalt voldoening uit de handeling. Extrinsieke motivatie houdt in dat de gebruiker door middel van een beloning of met een bepaald doel voor ogen gemotiveerd wordt om een bepaalde handeling te voltooien (Ryan &amp; Deci, 2000). </p><p>Volgens Malone &amp; Pepper zijn er vier individuele en vier interpersoonlijke factoren die invloed hebben op intrinsieke motivatie van een persoon. Interpersoonlijke factoren kunnen alleen aanwezig zijn wanneer er andere mensen in de buurt zijn.</p>",
        "columnTwo": "<h4>Individueel</h4><p><strong>Challenge</strong></p><p>Activiteiten die in een zekere mate uitdagend zijn veroorzaken de grootste vorm van intrinsieke motivatie. Hierbij is het belangrijk dat de uitdaging zinvol is voor de persoon.</p><p><strong>Curiosity</strong></p><p>Nieuwsgierigheid is de meest directe intrinsieke motivatie om te leren. Binnen deze factor is er onderscheid gemaakt tussen sensor curiosity: fysieke elementen zorgen voor de nieuwsgierigheid, en cognitive curiosity: het idee dat iets niet klopt of eigenaardig is.</p><p><strong>Control</strong></p><p>Mensen houden er van nature van om controle te houden over de situatie. Wanneer mensen de controle uit handen geven zorgt dit voor afstand tussen het doel en/of actie en de persoon zelf. Hierdoor raken mensen sneller gedemotiveerd als zij geen controle hebben.</p><p><strong>Fantasy</strong></p><p>Door het fantaseren over bepaalde fysieke of sociale situaties die gewenst of juist ongewenst zijn kan een persoon overgaan tot actie om deze situaties te bereiken of juist te vermijden. Hierdoor heeft het fantaseren invloed op de intrinsieke motivatie.</p><p>&nbsp;</p><h4>Interpersoonlijk</h4><p><strong>Cooperation and Competition</strong></p><p>Samenwerken en elkaar helpen werkt motiverend voor mensen. Dit geeft een goed gevoel en kan daardoor een positieve invloed hebben op de intrinsieke motivatie. Competitie is een motiverende factor omdat mensen van nature zichzelf vergelijken met andere en beter willen zijn dan de competitie.</p><p><strong>Recognition</strong></p><p>Erkenning en waardering van andere individuen zijn belangrijk voor mensen. Mensen genieten ervan om beloond te worden voor hun werk. Om dit te bereiken is het belangrijk dat de activiteiten van een persoon zichtbaar zijn voor de andere.</p>"
      },
      {
        "anchor": "ability",
        "chapter": "6.4.2 Ability",
        "columnOne": "<p>Fogg (2000) stelt dat het belangrijk is de handelingen zo makkelijk mogelijk te maken voor de gebruiker. Hiermee wordt de drempel om een handeling uit te voeren verlaagd. Fogg (2000) benoemt zes factoren die van invloed zijn op de &ldquo;simplicity&rdquo; van een handeling. Het woord Ability refereert naar de samenwerking tussen de simplicity factoren in de context van een Trigger. </p>",
        "columnTwo": "<p><strong>Time</strong></p><p>De tijd die een handeling vereist moet overeenkomen met de tijd die een gebruiker heeft of wilt vrij maken. Wanneer het gevoel ontstaat dat een handeling teveel tijd kost zal de gebruiker de handeling niet uitvoeren.</p><p><strong>Money</strong></p><p>Net als bij tijd moet het bedrag wat mogelijk voor een handeling gevraagd wordt overeenkomen met het bedrag dat de gebruiker er voor over heeft. Een te hoge prijs verhoogd de drempel om actie te ondernemen.</p><p><strong>Physical effort</strong></p><p>De fysieke handeling moet niet teveel eisen van de gebruiker. Wanneer de gebruiker het gevoel heeft dat hij of zij teveel moeite moet doen om de handeling te verrichten zal hij of zij dit niet doen.</p><p><strong>Brain cycles</strong></p><p>Als de gebruiker te lang en te veel moet nadenken over de handeling wordt deze niet als simpel ervaren.</p><p><strong>Social deviance</strong></p><p>De handeling mag niet in strijd staan met de normen en waarden van de samenleving waarin de gebruiker zich bevindt. Wanneer een handeling tegen deze normen en waarden in gaat wordt deze niet meer als gemakkelijk ervaren. </p><p><strong>Non routine</strong></p><p>Wanneer een handeling vereist dat de gebruiker tegen zijn of haar routine ingaat kan dit ervaren worden als moeilijk. Dit verhoogt de drempel om een handeling uit te voeren.</p>"
      },
      {
        "anchor": "triggers",
        "chapter": "6.4.3 Triggers",
        "columnOne": "<p>Het laatste onderdeel van het Fogg Behavior Model is de trigger, ook call to action, prompt, request, offer of cue genoemd. Zonder de trigger wordt het gewenste gedrag niet bereikt.</p><p>Een trigger laat de gebruiker weten dat een bepaalde handeling kan worden uitgevoerd.</p><p>Het succes van een trigger hangt af van de timing, de mate waarin de trigger wordt geassocieerd met de uit te voeren handeling en de opvallendheid van de trigger.</p><p>Fogg beschrijft drie verschillende types: Facilitator, Signal en Spark. </p><p><strong>Facilitator - </strong>Bedoelt voor gebruikers met hoge motivatie maar een lage ability. Een facilitator rijkt de benodigdheden aan om de handeling te verrichten.</p><p><strong>Sparks - </strong>Bedoelt voor gebruikers met een lage motivatie maar wel in de gelegenheid zijn om de handeling te verrichten (hoge ability). De Spark trigger moet de motivatie van de gebruiker positief be&iuml;nvloeden zodat het gewenste gedrag bereikt wordt.</p><p><strong>Signals -</strong> Bedoelt voor gebruikers met een hoge motivatie en gelegenheid om de handeling te verrichten (hoge ability). Het laatste duwtje in de goede richting.</p>",
        "images": [
          {
            "src": "../assets/images/scriptie/ability-fogg.jpg",
            "caption": "Figuur 13. Fogg Behavior Model - Triggers"
          }
        ]
      },
      {
        "anchor": "toepassing-en-conclusie",
        "chapter": "6.4.4 Toepassing en conclusie",
        "columnOne": "<p>Ervoor zorgen dat gebruikers de gewenste handelingen verrichten is niet zo makkelijk als het lijkt. Er zijn veel factoren waar rekening mee moet worden gehouden. </p><p>Een belangrijk onderdeel van het concept is het beoordelen en toevoegen van items. Om ervoor te zorgen dat gebruikers items posten en beoordelen is de theorie van Fogg verwerkt in het concept.</p><p>De Frontend Developers van TamTam zijn gemotiveerd om artikelen te delen en hierover te discussi&euml;ren. Wanneer artikelen gedeeld worden in de Hipchat groep worden meningen over de content uitgewisseld. De gebruikers worden intrinsiek gemotiveerd om artikelen te delen en te beoordelen. </p><p><strong>Motivatie</strong></p><p>Binnen het concept wordt ingespeeld op de interpersoonlijke factoren Cooperation &amp; Competition en Recognition van de intrensieke motivatie. </p><p>De emojis kunnen zorgen voor waardering voor het posten van het item. Er is bewust gekozen om de naam van de gebruiker te tonen die het item heeft geplaatst zodat alle gebruikers kunnen zien wie het item heeft gepost. </p><p>Het featured item is de ultieme vorm van waardering binnen het platform. Dit is het best beoordeelde artikel van de week. Door de beoordelingen door middel van emojis en het featured item wordt het competitie gevoel in de gebruikers getriggerd.</p><p>Binnen de browserextensie wordt de intrinsieke motivatie veroorzaakt door te benadrukken dat door middel van het beoordelen collega&rsquo;s worden geholpen. Daarnaast wordt getoond hoeveel collega&rsquo;s reeds een beoordeling hebben achter gelaten. Door te zien dat andere collega&rsquo;s ook de moeite hebben genomen om te beoordelen wordt de motivatie om ook een steentje bij te dragen verhoogd.</p>",
        "columnTwo": "<p><strong>Ability</strong></p><p>Het makkelijk kunnen delen en beoordelen is een van de belangrijkste factoren, al dan niet de aller belangrijkste. Als de drempel te hoog is om artikelen te delen en te beoordelen zal de doelgroep zijn gedrag niet aanpassen en blijft de situatie zoals dat nu is. Uit het doelgroep onderzoek bleek dat de frontend developers van TamTam niet staan te wachten op een extra platform wat zij moeten gebruiken. Daarom is het van belang dat het gebruik van het platform zo simpel mogelijk is.</p><p>Om dit zo makkelijk mogelijk te maken is de integratie met de huidige gebruikte tools opgezet. Door middel van deze integratie hoeven de gebruikers zo min mogelijk handelingen te verrichten om een item te posten. De werking van dit ecosysteem is beschreven in hoofdstuk 6.1.</p><p><strong>Trigger</strong></p><p>De browser extensie detecteert wanneer de gebruiker een item bekijkt dat aanwezig is in de database. Om de trigger op het juiste moment te laten plaats vinden wordt de popup pas getoond als de gebruiker 75% van de lengte van het artikel heeft gescrold. </p><p>Hierdoor is de kans groot dat de gebruiker pas beoordeelt nadat het artikel daadwerkelijk is gelezen, dit is het meest relevante moment om een beoordeling achter te laten en verhoogt zo de kans op het gewenste gedrag. Hierbij moet vermeld worden dat er nooit 100% kan worden gegarandeerd dat de popup altijd getoond wordt nadat de gebruiker het artikel heeft gelezen.</p>",
        "imagesFullWidth": true,
        "images": [
          {
            "src": "../assets/images/scriptie/featured-item-v1.png",
            "caption": "Figuur 14. Prototype V1: Featured item web applicatie"
          },
          {
            "src": "../assets/images/scriptie/browser-extensie-2.png",
            "caption": "Figuur 15. Browserextensie beoordeel popup"
          },
          {
            "src": "../assets/images/scriptie/browser-extensie-1.jpg",
            "caption": "Figuur 16. Browser extensie beoordeel popup in context"
          }
        ]
      },
      {
        "anchor": "business-model-canvas",
        "chapter": "6.5 Business Model Canvas",
        "columnOne": "<p>Het Business Model Canvas is een tool om visueel in kaart te brengen wat de belangrijkste element zijn en hun relatie tot elkaar. Het ingevulde canvas geeft een duidelijke samenvatting van het concept vanuit een business perspectief.</p><p>Het business model canvas bestaat uit negen verschillende gebieden:</p>",
        "columnTwo": "<ul><li><strong>Key Partners:</strong> De partijen waar je een relatie mee aangaat om het product draaiende te houden.</li><li><strong>Key Activities: </strong>De belangrijkste activiteiten die ondernomen moeten worden om de Value Propositions waar te maken en de Customer Relationships staande te houden.</li><li><strong>Key Resources: </strong>De benodigde middelen om waarde te cre&euml;ren voor de gebruikers.</li><li><strong>Value Propositions: </strong>De services die het product heeft te bieden. De unieke waarde die het product cre&euml;ert voor de gebruiker. Het gene wat het product anders maakt dan andere producten.</li><li><strong>Customer Segments: </strong>Groepen gebruikers die het product zullen gebruiken.</li><li><strong>Channels: </strong>De middelen waarmee de gebruikers worden bereikt om het product te leveren.</li><li><strong>Cost Structure: </strong>De belangrijkste kosten voor de business.</li><li><strong>Revenue streams: </strong>de belangrijkste inkomsten bronnen. Zoals normaal wel het geval is kunnen in dit geval hier lastig cijfers aan gehangen worden.</li></ul>",
        "imagesFullWidth": true,
        "images": [
          {
            "src": "../assets/images/scriptie/business-model-canvas.jpg",
            "caption": "Figuur 17. Business Model Canvas"
          }
        ]
      }
    ]
  },
  {
    "anchor": "prototype-v1",
    "chapter": "7. Prototype V1",
    "subchapters": [
      {
        "anchor": "prototype-v1",
        "chapter": "Introduction",
        "columnOne": "<p>Van het ecosysteem is de user interface in de vorm van een webapplicatie uitgewerkt. Vanaf het begin van het traject was een van de belangrijkste doelen om een werkbaar prototype neer te zetten wat volledig zonder enige vorm supervisie door de gebruikers getest kan worden. </p><p>In dit hoofdstuk worden de onderdelen van de eerste versie van het prototype beschreven.</p><p>In de eerste versie van het prototype is alleen de interface voor de artikelen die binnen de groep gedeeld zijn uitgewerkt. De sectie met de persoonlijk opgeslagen artikelen zal in een later stadium uitgewerkt worden.</p>",
        "columnTwo": "<p>Doordat de focus binnen het project op het concept en de techniek ligt is er minder onderzoek gedaan naar de vormgeving. Deze is zo simpel mogelijk gehouden. Vanwege de uitdaging in de techniek is het design alleen geoptimaliseerd voor laptop / desktop scherm formaten.</p><p>De eerste versie van het prototype is te bekijken op:</p><p><a href='http://prototype-v1.tomsnepvangers.com' target='_blank'>http://prototype-v1.tomsnepvangers.com</a></p>"
      },
      {
        "anchor": "featured-item",
        "chapter": "7.1 Featured Item",
        "text": "<p>Het item dat de meeste positieve beoordeling heeft ontvangen wordt het featured item van de week. De gebruiker ziet dit item als eerste wanneer de webapplicatie wordt geopend. De gebruiker krijgt hierdoor meteen een suggestie voorgeschoteld. Dit verminderd de keuze stress en het gevoel van information overload.</p>",
        "images": [
          {
            "src": "../assets/images/scriptie/featured-item-v1-2.png",
            "caption": "Figuur 18. Prototype V1: Featured item"
          }
        ]
      },
      {
        "anchor": "add-item-formulier",
        "chapter": "7.2 Add Item formulier",
        "text": "<p>Het is binnen de tijdsperiode van het project niet haalbaar om de automatisering van het toevoegen van artikelen te realiseren. Gebruikers kunnen via het &ldquo;Add item&rdquo; formulier een item toevoegen. Hierbij kan de gebruiker categorie&euml;n en tags kiezen of toevoegen. Daarnaast is het vereist om een beoordeling te geven. Wanneer de gebruiker het item toevoegt wordt op de achtergrond de metadata van de url opgehaald. Dit zijn de afbeelding, de titel en de beschrijving van de desbetreffende pagina.</p>",
        "video": {
          "src": "../assets/video/add-item-form.mov",
          "caption": "Figuur 19. Prototype V1: Add item formulier"
        }
      },
      {
        "anchor": "categorieen-en-tags",
        "chapter": "7.3 Categorieën en tags",
        "text": "<p>De getoonde items zijn filterbaar door middel van categorie&euml;n en tags binnen de categorie&euml;n. Na het selecteren van een categorie worden de tags binnen de categorie zichtbaar onder de buttons van de categorie&euml;n.</p>",
        "video": {
          "src": "../assets/video/category-and-tags.mov",
          "caption": "Figuur 20. Prototype V1: Categorieën en tags"
        }
      },
      {
        "anchor": "item",
        "chapter": "7.4 Item",
        "text": "<p>Een item wordt weergegeven door middel van een card. Een item bevat geautomatiseerde meta data (titel, afbeelding, beschrijving, toegevoegd door) en user input data (categorie&euml;n, tags, beoordeling). De beoordeling met het hoogste aantal wordt rechtsboven de card getoond. Hierdoor valt deze op en is het voor de gebruiker makkelijker hierop te filteren.</p>",
        "video": {
          "src": "../assets/video/item-card.mov",
          "caption": "Figuur 21. Prototype V1: Item card"
        }
      },
      {
        "anchor": "realtime",
        "chapter": "7.5 Realtime",
        "text": "<p>Alle interactie binnen het platform gebeurt realtime. Dit houdt in dat gebruikers elkaars acties live op het beeldscherm zien. Wanneer gebruiker A een item beoordeelt, ziet gebruiker B dit live gebeuren. De combinatie tussen React, Redux en Firebase maakt dit mogelijk. </p><p>Deze feature biedt mogelijkheden voor in de toekomst. Features die live communicatie vereisen kunnen in een later stadium gemakkelijk worden toegevoegd.</p>",
        "images": [
          {
            "src": "../assets/images/scriptie/react-firebase.png"
          }
        ]
      }
    ]
  },
  {
    "anchor": "prototype-v2",
    "chapter": "8. Prototype V2",
    "subchapters": [
      {
        "anchor": "prototype-v2",
        "chapter": "Introductie",
        "columnOne": "<p> Gedurende twee weken is de eerste versie van het prototype getest. Om de gebruikers de mogelijkheid te geven snel feedback achter te laten zijn er twee knoppen in het prototype verwerkt. Een voor snelle feedback en een voor uitgebreidere feedback. </p><p>Via de &ldquo;Quick feedback&rdquo; optie kunnen gebruikers snelle losse opmerkingen plaatsen over bijvoorbeeld de User Experience.</p><p>De normale feedback button leidt naar een uitgebreider feedback formulier welke is opgezet met de &ldquo;I Like, I Wish, What If&rdquo;. Deze methode geeft testpersonen de mogelijkheid op een positieve manier constructieve feedback achter te laten. De vraagstelling zorgt ervoor dat de feedback op een positieve manier gebracht wordt en de drempel om negatieve feedback te geven wordt verlaagt. </p><p>De drie vragen worden voor het featured item, de item feed en categorie&euml;n &amp; tagging functionaliteit en beoordelingssysteem gesteld om per onderdeel feedback te vergaren.</p>",
        "columnTwo": "<p><strong>I Like</strong></p><p>Deze vraag moedigt de gebruiker aan om aspecten die hij of zij leuk vindt aan het prototype te benoemen. Dit zorgt voor positieve feedback.</p><p><strong>I Wish</strong></p><p>Gebruikers worden gevraagd idee&euml;n te delen over hoe het prototype gewijzigd of verbeterd kan worden. Dit is een manier om negatieve feedback en opbouwende kritiek te verzamelen.</p><p><strong>What if</strong></p><p>Door middel van deze vraag kunnen gebruikers nieuwe suggesties opperen die nog niet aanwezig zijn of een directe link hebben met het prototype. Dit opent mogelijkheden voor nieuwe idee&euml;n welke kunnen worden onderzoek voor mogelijke iteraties. </p>"
      },
      {
        "anchors": "resultaten-en-iteraties",
        "chapter": "8.1 Resultaten & iteraties",
        "columnOne": "<p>Met een aantal frontend developers zijn Expert Reviews gehouden. Omdat de developers niet uit zichzelf het uitgebreide feedback formulier invulden is in de vorm van een gesprek het formulier besproken en ingevuld.</p><p>De doelgroep zijn experts op het gebied van websites en webapplicaties. De expert reviews hebben waardevolle inzichten gebracht over positieve kanten en verbeterpunten. Daarnaast zijn via het Quick Feedback formulier bugs en user experience gerelateerde verbeterpunten verzameld. </p><p>Vanuit deze resultaten is het prototype aangepast en verbeterd. Per onderdeel wordt een samenvatting van de bevindingen beschreven met afbeeldingen van de tweede versie van het prototype.</p>",
        "columnTwo": "<p>Er moet hierbij vermeld worden dat er meer waardevolle feedback is gegeven dan hieronder wordt vermeld. Echter moest er een keuze worden gemaakt in wat technisch realiseerbaar was in de resterende tijd. De haalbare punten zijn verwerkt en hieronder beschreven. De over gebleven feedback punten worden meegenomen in de aanbevelingen.</p><p>Een volledige uittreksel van de feedback punten is te bekijken in <a href='http://logboek.tomsnepvangers.com' target='_blank'>week 17 van het logboek</a>. </p><p>De tweede versie van het prototype is te bekijken op <a href='http://prototype.tomsnepvangers.com' target='_blank'>http://prototype.tomsnepvangers.com</a></p>"
      },
      {
        "anchor": "featured-item",
        "chapter": "8.1.1 Featured Item",
        "text": "<p>Het Featured Item wordt beschouwd als een waardevolle toevoeging binnen de webapplicatie. In een oogopslag kunnen zien wat de meest beoordeelde items zijn zorgt ervoor dat er direct een waardevolle suggestie wordt gedaan.</p><p>Vanuit de feedback blijkt dat er behoefte is aan discussie. Meerdere respondenten geven aan hun mening te willen geven op items door middel van een comment systeem. Daarnaast wordt geopperd om ook voor de andere beoordelingscategorie (Food For Thought) een featured item te tonen. </p><p>Deze bovengenoemde punten zijn verwerkt in de tweede versie van het prototype.</p><p>De featured Item sectie bevat nu de hoogst beoordeelde items van beide beoordelingscategorie&euml;n. Daarnaast kan de gebruiker (live) discussi&euml;ren over een item door op het item te klikken en de modal (popup) te openen met de discussie chat.</p>",
        "images": [
          {
            "src": "../assets/images/scriptie/item-discussion.png",
            "caption": "Figuur 22. Prototype V2: Item Popup met discussie chat"
          }
        ],
        "comparisonImagesFullWidth": true,
        "comparisonImages": [
          {
            "width": "1031",
            "height": "525",
            "imageOne": "../assets/images/scriptie/comparison-featured-item-old.png",
            "imageTwo": "../assets/images/scriptie/comparison-featured-item-new.png",
            "caption": "Figuur 23. Prototype Vergelijking V1/V2: Featured Items"
          }
        ]
      },
      {
        "anchor": "item-list-category-tagging",
        "chapter": "8.1.2 Item List, categorieën, tagging",
        "text": "<p>De item cards worden als fijn ervaren doordat de combinatie van een afbeelding, categorie&euml;n &amp; tags, titel, beschrijving en beoordeling een duidelijke indrukt geeft wat de inhoud van een item is. De respondenten geven aan dat zij door middel van de tags en categorie&euml;n (zowel filter mogelijkheden als visuele weergave op een item card) kunnen zien welke items content bevat die hen interesseert.</p><p>Een opmerking die veel voorkam in zowel de interviews als de Quick Feedback lijst is de vraag naar een lijst weergave van de Item List. Om snel door alle items heen te scannen is een lijst weergave geschikter dan een grid weergave. Daarnaast werd aangegeven dat de user interface in het algemeen wat groot is.</p><p>De tweede versie van het prototype bevat de mogelijkheid om te wisselen tussen een lijst en grid weergave. De item cards en categorie en tag filters zijn kleiner gemaakt. Daarnaast is de volgorde van de items gesorteerd op de meest aantal beoordelingen (onafhankelijk van welke soort beoordeling). Dit was oorspronkelijk al de bedoeling maar nog niet technisch uitgewerkt. Nadat dit punt zowel in de Quick Feedback als Expert Reviews is terug gekomen is besloten hier toch meer aandacht aan te besteden om dit te realiseren.</p>",
        "images": [
          {
            "src": "../assets/images/scriptie/feed-list.png",
            "caption": "Figuur 24. Prototype V2: Lijst weergave"
          }
        ],
        "comparisonImagesFullWidth": true,
        "comparisonImages": [
          {
            "width": "982",
            "height": "500",
            "imageOne": "../assets/images/scriptie/item-list-comparison-1.png",
            "imageTwo": "../assets/images/scriptie/item-list-comparison-2.png",
            "caption": "Figuur 25. Prototype Vergelijking V1/V2: Grid weergave"
          }
        ]
      },
      {
        "anchor": "emoji-rating-systeem",
        "chapter": "8.1.3 Emoji rating systeem",
        "text": "<p>Het rating systeem is simpel en doeltreffend. De doelgroep ervaart het gebruik ervan als laagdrempelig en effectief. Door de ratings wordt het kiezen van een item als gemakkelijker ervaren. Het feit dat er niet meer dan twee opties zijn zorgt ervoor dat het overzichtelijk blijft. </p><p>Gebruikers geven aan dat zij willen zien wie de beoordelingen hebben achter gelaten. Hierdoor is het mogelijk om te zien wie het artikel heeft gelezen en kan de discussie over het item aangegaan worden. Ook hier kwam de behoefte aan discussie naar boven. Ook viel op dat de discutabele beoordeling (Food For Thought) wordt geassocieerd met een negatieve rating. De emoji op zich zelf brengt de boodschap van de beoordeling niet bij iedereen goed over.</p><p>In de tweede versie van het prototype is het mogelijk voor gebruikers om te zien welke gebruikers de beoordelingen hebben gegeven. Om de bedoeling van de beoordelingen duidelijker te maken is de text van de beoordeling zichtbaar wanneer deze beoordeling geselecteerd is.</p>",
        "video": {
         "src": "../assets/video/item-card-v2.mov",
          "caption": "Figuur 26. Prototype V2: Zie beoordeling"
        },
        "comparisonImagesFullWidth": true,
        "comparisonImages": [
          {
            "width": "534",
            "height": "500",
            "imageOne": "../assets/images/scriptie/item-card-comparison-1.png",
            "imageTwo": "../assets/images/scriptie/item-card-comparison-2.png",
            "caption": "Figuur 27. Prototype Vergelijking V1/V2: Item Card"
          }
        ]
      },
      {
        "anchor": "prototype-v2-conclusie",
        "chapter": "8.2 Conclusie",
        "columnOne": "<p>Het laten testen van het prototype en interviewen van de doelgroep heeft waardevolle inzichten opgeleverd. De doelgroep is erg kritisch, dit is immers hun vak.</p><p>Aangezien het prototype een werkend product is moest er een keuze worden gemaakt op de haalbaarheid van de technische realisatie tussen de feedback punten in de resterende tijd. Dit is een nadeel van een technisch werkend prototype, de drempel om features toe te voegen en zaken aan te passen ligt hoger dan bij bijvoorbeeld een paper prototype. Echter zorgt deze manier ervoor dat er iteratief kan worden ontwikkeld. Dit is de gebruikelijke manier van werken binnen TamTam. Daarnaast kan door middel van een technisch werkend prototype de echte interactie en het gebruik van het product worden getest.</p>",
        "columnTwo": "<p>De tweede versie van het prototype bevat de twee meest voorkomende features die genoemd werden in zowel de Quick Feedback als de Expert Reviews: de lijstweergave en discussie chat.</p><p>De lijstweergave biedt de mogelijkheid om sneller door de items heen te scannen. Daarnaast zorgt de discussie chat ervoor dat er meer interactie op het platform plaats kan vinden en het samen leren aspect wordt verhoogd.</p><p>Gedurende het gebruik van het platform in de toekomst is het de bedoeling dat het iteratieve proces continueert en de overige feedback punten worden verwerkt.</p>"
      }
    ]
  },
  {
    "anchor": "conclusie",
    "chapter": "9. Conclusie",
    "columnOne": "<p>In de conclusie wordt antwoord gegeven op de design challenge die aan het begin van het project is vastgesteld:</p><p>&ldquo;Hoe kan een centraal platform ervoor zorgen dat de frontend developers van TamTam elkaar up to date houden en vakinhoudelijke content met elkaar kunnen delen zodat zij niet verdrinken in de overload aan beschikbare online content over het vakgebied&rdquo;</p><p>De oorspronkelijk bedachte oplossing, een platform, is uiteindelijk een onderdeel geworden van het concept: het online ecosysteem gevuld met user curated content.</p><p>In het online ecosysteem staat de API en de database centraal. Op de API zijn &lsquo;Suppliers&rsquo; en &lsquo;Distributers&rsquo; aangesloten. Suppliers (Slack, Hipchat) zijn services die content aan de database toevoegen, Distiributors zijn de kanalen (webapp, nativeapp, browserextensie) waarop de opgeslagen content wordt weergegeven. </p><p>Flexibiliteit is de hoeksteun van het concept. Vanaf het begin van het traject is rekening gehouden met het feit dat het concept een uitkomst kan bieden voor meerdere doelgroepen. Een groep professionals kan de gewenste services aansluiten op het ecosysteem en vervolgens de gewenste kanalen in gebruik nemen.</p><p>Het uitgewerkte onderdeel van het concept, de webapplicatie, is gemaakt met React, Redux en Firebase. Beide technieken ondersteunen zowel native als web applicaties. Dit gegeven maakt het een uitstekende combinatie om te gebruiken voor cross platform development (schaalbaarheid). Daarnaast zorgt de combinatie tussen deze twee technieken ervoor dat alle data op het platform realtime wordt ge&uuml;pdatet in de user interface.</p><p>Het prototype van de webapplicatie bevat een verzameling van alle gedeelde content.</p><p>Om de gebruiker direct twee suggesties te geven worden de twee hoogst beoordeelde items van de week per beoordelingscategorie, &ldquo;This Item Rocks&rdquo; &amp; &ldquo;Food For Thought&rdquo; bovenaan de applicatie getoond, de &ldquo;Featured Items&rdquo; . Onder de featured items staat de feed met alle gedeelde artikelen. Binnen deze lijst kunnen gebruikers filteren op categorie&euml;n en tags.</p>",
    "columnTwo": "<p>Een stuk gedeelde online content (een item) bevat een aantal stukken informatie, zowel automatisch gegenereerd als ingevoerd door de gebruiker. De gebruiker voegt zelf een categorie, tags en een beoordeling toe. De afbeelding, titel, beschrijving en uploader van het item worden automatisch opgehaald door middel van een aparte API. Daarnaast kunnen gebruikers een (live) discussie voeren en een beoordeling achterlaten op alle gedeelde items. </p><p>Het beoordelingssysteem zorgt voor een extra dimensie binnen het platform. Gebruikers kunnen het gevoel wat zij bij een artikel hebben uiten door middel van twee simpele opties: &ldquo;This Item Rocks&rdquo; &amp; &ldquo;Food For Thought&rdquo;. Beide categorie&euml;n hebben hun eigen emoji. Deze vorm van beoordelen wordt door de gebruikers ervaren al simpel en doeltreffend. Het biedt een extra manier om relevantie binnen de opgeslagen content te filteren. </p><p>De gebruikers worden gestimuleerd om content op het platform te delen en beoordelen. Volgens het Fogg Behaviour Model zijn er drie benodigde factoren: motivatie, triggers en ability. De verhoudingen tussen deze drie factoren moeten in balans zijn om de gebruiker een bepaalde handeling te laten verrichten. De combinatie van de flexibiliteit van het ecosysteem, de triggers via de browser extensie &amp; chat applicatie bots, plus de al aanwezige motivatie van de gebruikers om online content te delen en collega&rsquo;s te helpen zorgen ervoor dat online content gedeeld en beoordeeld wordt. </p><p>Antwoord gevend op de hoofdvraag: de Frontend Developers van TamTam houden elkaar up to date door online content over het vakgebied te delen en te beoordelen. Het information overload gevoel wordt enigszins getackeld door de featured items en het beoordelingssysteem. De user interface is echter nog niet volledig bestand tegen grote hoeveelheden content. In de toekomst zal de user interface van de webapplicatie moeten worden blijven getest en door ontwikkeld. Desondanks voldoet het product aan de oplossing van het probleem waar het mee begon: een digitale centrale plek faciliteren voor alle gedeelde online content over het vakgebied.</p>"
  },
  {
    "anchor": "aanbevelingen",
    "chapter": "10. Aanbevelingen",
    "columnOne": "<p>Gedurende het project was al vrij snel duidelijk dat maar een klein deel van het concept kon worden uitgewerkt. Tijdens het traject zijn er allerlei idee&euml;n naar boven gekomen om het concept nog beter te maken. In dit hoofdstuk worden de toevoegingen die niet tot nauwelijks aan bod zijn gekomen in het document of naar zijn gerefereerd.</p>",
    "columnTwo": "<p><strong>Artificial intellegence </strong></p><p>De automatisering van het ecosysteem kan door middel van AI naar een hoger niveau worden gebracht. Categorie&euml;n en tags kunnen direct als suggesties worden ingevuld wanneer de gebruiker een item toevoegt. Daarnaast kan aan de hand van gebruikers data personalisatie van het platform worden toegepast. Denk hierbij aan push notificaties van voorgestelde items op bepaalde tijdstippen en plaatsen waarop een gebruiker frequent items bekijkt.</p><p><strong>Andere vormen van Suppliers</strong></p><p>Binnen de context van dit project is gekeken naar een tweetal soort Suppliers: chat app bots en de browserextensie. Tijdens het traject zijn er tal van andere soorten Suppliers omhoog gekomen die kunnen worden gebruikt om content toe te voegen. Denk hierbij aan integratie met nieuwsbrieven, blogposts etc.</p><p><strong>Layout</strong></p><p>Vanuit de quick feedback kwam naar voren dat sommige gebruikers hun layout willen aanpassen. De mogelijkheid om te kiezen tussen een aantal layouts zou een waardevolle toevoeging zijn voor de user interface.</p><p><strong>Leestijd van items</strong></p><p>De mogelijkheid om leestijd van artikelen te tonen zou een goede toevoeging zijn op het concept. De leestijd zou een extra relevantie indicator kunnen zijn. Hierdoor kan het aanbod nog specifieker worden afgestemd op de behoeften van de gebruiker. Technisch gezien was dit binnen het tijdsbestek niet makkelijk uitvoerbaar. Hier zal nader onderzoek naar gedaan moeten worden.</p><p><strong>Automatisch archiveren van items</strong></p><p>Om de information overload binnen het platform tegen te gaan zou het automatisch archiveren van items een waardevolle toevoeging kunnen zijn. Gebruikers zouden bijvoorbeeld zelf kunnen instellen na hoeveel dagen bepaalde items naar het archief overgezet moeten worden.</p><p><strong>Zoekbalk</strong></p><p>Een van de suggesties die naar boven kwam in het testen van het prototype was het vervangen van de categorie en tags filter lijst voor een zoekbalk waarin gezocht kan worden naar de tags en categorie&euml;n. Hierdoor zou het ruimte probleem wat ontstaat bij teveel tags en categorie&euml;n worden opgelost. De functie van de tags en categorie&euml;n veranderd echter wel, dit zou goed moeten worden getest alvorens de wijziging wordt doorgevoerd.</p>"
  }
]