[
  {
    "chapter": "Management Samenvatting",
    "text": "<b>Introduction</b></br>Ik wil dat een groep professionals een online centrale plek hebben waar zij online content over het vakgebied kunnen delen, opslaan, ontdekken en aanraden. <b>Claim</b></br>Het online ecosysteem zorgt ervoor dat een groep professionals een platform heeft met relevante online content over het vakgebied waardoor collega’s elkaar up to date houden.</br><b>Topic</b></br>Ik heb onderzoek gedaan naar het delen van informatie over het vakgebied tussen collega’s (frontend developers van TamTam) en hoe zij de gedeelde content opslaan om op een later moment terug te kijken. Hiermee heb ik in kaart gebracht wat voor methode’s er gebruikt worden om te delen en op te slaan. Wat de positieve en negatieve punten van deze methode’s zijn en welke zaken echt missen.</br><b>The study</b></br>Is de manier waarop groepen professionals inspiratie met elkaar delen over het vakgebied efficiënt? Deze vraag komt voort uit een groter overkoepelend probleem: information overload. Er zijn ontzettend veel artikelen, tutorials, websites die allerlei content voorschotelen. Wat moet jij als professional bekijken? Hoe maak je de keuze wat voor jou relevant is? De content die collega’s met elkaar delen is relevant. Echter zijn de manieren waarop dit opgeslagen wordt niet efficiënt. De links naar de online content verdwijnen in chat of mail feeds, waardoor het erg lastig is om deze op een later moment terug te vinden.</br><b>Results</b></br>De mening onder frontend developers van TamTam over dit topic is verdeeld. Enerzijds zeggen een aantal van hen dat delen via hipchat en mail oke is. Overigens werd door deze personen vermeld dat er geen andere manier is. Het andere deel vind dat de manier waarop het nu wordt gedeeld niet efficiënt is. Links verdwijnen in de chat feed en het handmatig moeten opslaan in een notitie app is niet handig. Daarnaast hebben developers behoefte aan een indicatie van relevantie. Ook is het belangrijk dat het systeem zich integreert binnen de huidige workflow van het bedrijf.</br><b>Discussion</b></br>De uitdaging die zich voordoet is om er voor te zorgen de information overload zich niet verplaatst naar het platform. Als artikelen op het platform gezet worden krijg je uiteindelijk ook een overload aan content. Om dit tegen te gaan wordt er gebruik gemaakt van zelf toegevoegde categorieën en filters. Daarnaast is er een recommandatie systeem toegevoegd om de relevantie van artikelen aan te tonen. Zo kunnen de gebruikers sneller beoordelen wat zij willen lezen. Bovendien lokt het discussie uit. Artikelen die al gelezen zijn worden in het archief gezet. Een ander heikelpunt is het toevoegen van de artikelen, de vraag is of gebruikers dat wel gaan doen. De drempel moet zo laag mogelijk gemaakt worden om zowel content toe te voegen als te beoordelen. Vanuit die gedachte is het ecosysteem opgezet. De huidige services die gebruikt worden delen automatisch de content naar de database. Zo blijft de huidige manier van delen bestaan, het delen via hipchat, en integreert het eco systeem binnen de huidige werkflow (of beter gezegd, integreert de huidige werkflow binnen het ecosysteem). Een browser extensie detecteert wanneer een opgeslagen artikel wordt geopend in de browser en vraagt om het artikel te beoordelen.</br><b>Conclusion</b></br>Door het gebruik van het ecosysteem gaat waardevolle online content niet verloren. Gebruikers kunnen terecht op het platform om content te vinden over het vakgebied. Content die gestructureerd geordend is en beoordeelt is op relevantie. Het is de plek waar mensen naar toe gaan om relevante online content over het vakgebied te ontdekken."
  }
]