[
  {
    "anchor": "voorwoord",
    "chapter": "Voorwoord",
    "twoColumns": true,
    "columnOne": "<p>De eindstreep is in zicht. Na vier jaar ontzettend te hebben genoten van de opleiding Communication &amp; Multimedia zitten mijn laatste twintig weken er op. Het begon allemaal met de Partners in Paars, een hechte groep die al snel naam hadden gemaakt bij alle andere kleurrijke groepen in het eerste jaar van de studie. Na in 2015 samen met Gijs en Victorine de zilveren SpinAward te hebben bemachtigd in de categorie Young Talent met het concept PLECK werd &eacute;&eacute;n ding duidelijk: ik wilde in staat zijn zelf te kunnen maken wat ik in mij opkomt. Vanuit die gedachte ben ik mij gaan verdiepen in Frontend Development. Vervolgens studeer je 3 jaar later af bij &eacute;&eacute;n van de meest gerenommeerde bedrijven van Nederland, het is allemaal snel gegaan.</p><p>In een periode van 20 weken is een concept neergezet met een technisch werkend prototype wat momenteel in gebruik is door de Frontend Developers van TamTam. Het ging uiteraard niet zonder slagen of stoten, maar ik ben trots op het resultaat. </p><p>Zonder een aantal mensen was mij dit niet gelukt. Daarom wil deze mensen bedanken voor hun hulp, inzet en steun de afgelopen paar maanden.</p>",
    "columnTwo": "<p><strong>Jeroen Reumkens</strong></p><p>Jeroen, wat een topper ben jij. Na een fijne tijd als stagiair met jou als buddy kon ik mij geen beter persoon voorstellen om mij te begeleiden vanuit TamTam dan jij. Altijd positief, enthousiast en behulpzaam. Ik wil je bedanken voor alle moeite en tijd die je hebt gestoken in het helpen en begeleiden van mij.</p><p><strong>Lucas Nutbey</strong></p><p>Lucas, de strateeg van TamTam. &ldquo;Niet luisteren naar wat school wilt, maar doen wat het beste is voor je product!&rdquo; zei jij altijd. Een wijze les. Bedankt voor de inzichten en het meedenken bij het concreet maken van het concept.</p><p><strong>CMD Squad</strong></p><p>Sinds de propedeuse vormen we al de drie musketiers. Christian, Pierre en Tom. Vanaf de eerste stageperiode is de Slack groep ontstaan waarin we elke dag dingen met elkaar delen. Soms wel meer dan met de collega&rsquo;s die naast je zitten. Als mensen aan mij vragen: &ldquo;heb jij nog vrienden overgehouden aan je studie?&rdquo;, dan zeg ik zekerste weten. Bedankt voor het meedenken en het bieden van een luisterend oor tijdens klaagbakens over hoe weinig zin ik er soms meer in had.</p><p><strong>Frontend Developers van TamTam</strong></p><p>Bedankt jongens en meisjes voor het geven van feedback, testen (lees: afbranden, geintje ;)) van m&rsquo;n prototype, en vooral het rellen. Ik heb er erg om gelachen. Zonder jullie zou het product waardeloos zijn. Geef jezelf een sticker.</p>"
  },
  {
    "anchor": "management-samenvatting",
    "chapter": "Management Samenvatting",
    "twoColumns": true,
    "columnOne": "<b>Introduction</b></br>Ik wil dat een groep professionals een online centrale plek hebben waar zij online content over het vakgebied kunnen delen, opslaan, ontdekken en aanraden.</br></br><b>Claim</b></br>Het online ecosysteem zorgt ervoor dat een groep professionals een platform heeft met relevante online content over het vakgebied waardoor collega’s elkaar up to date houden.</br></br><b>Topic</b></br>Ik heb onderzoek gedaan naar het delen van informatie over het vakgebied tussen collega’s (frontend developers van TamTam) en hoe zij de gedeelde content opslaan om op een later moment terug te kijken. Hiermee heb ik in kaart gebracht wat voor methode’s er gebruikt worden om te delen en op te slaan. Wat de positieve en negatieve punten van deze methode’s zijn en welke zaken echt missen.</br></br><b>The study</b></br>Is de manier waarop groepen professionals inspiratie met elkaar delen over het vakgebied efficiënt? Deze vraag komt voort uit een groter overkoepelend probleem: information overload. Er zijn ontzettend veel artikelen, tutorials, websites die allerlei content voorschotelen. Wat moet jij als professional bekijken? Hoe maak je de keuze wat voor jou relevant is? De content die collega’s met elkaar delen is relevant. Echter zijn de manieren waarop dit opgeslagen wordt niet efficiënt. De links naar de online content verdwijnen in chat of mail feeds, waardoor het erg lastig is om deze op een later moment terug te vinden.",
    "columnTwo": "<b>Results</b></br>De mening onder frontend developers van TamTam over dit topic is verdeeld. Enerzijds zeggen een aantal van hen dat delen via hipchat en mail oke is. Overigens werd door deze personen vermeld dat er geen andere manier is. Het andere deel vind dat de manier waarop het nu wordt gedeeld niet efficiënt is. Links verdwijnen in de chat feed en het handmatig moeten opslaan in een notitie app is niet handig. Daarnaast hebben developers behoefte aan een indicatie van relevantie. Ook is het belangrijk dat het systeem zich integreert binnen de huidige workflow van het bedrijf.</br></br><b>Discussion</b></br>De uitdaging die zich voordoet is om er voor te zorgen de information overload zich niet verplaatst naar het platform. Als artikelen op het platform gezet worden krijg je uiteindelijk ook een overload aan content. Om dit tegen te gaan wordt er gebruik gemaakt van zelf toegevoegde categorieën en filters. Daarnaast is er een recommandatie systeem toegevoegd om de relevantie van artikelen aan te tonen. Zo kunnen de gebruikers sneller beoordelen wat zij willen lezen. Bovendien lokt het discussie uit. Artikelen die al gelezen zijn worden in het archief gezet. Een ander heikelpunt is het toevoegen van de artikelen, de vraag is of gebruikers dat wel gaan doen. De drempel moet zo laag mogelijk gemaakt worden om zowel content toe te voegen als te beoordelen. Vanuit die gedachte is het ecosysteem opgezet. De huidige services die gebruikt worden delen automatisch de content naar de database. Zo blijft de huidige manier van delen bestaan, het delen via hipchat, en integreert het eco systeem binnen de huidige werkflow (of beter gezegd, integreert de huidige werkflow binnen het ecosysteem). Een browser extensie detecteert wanneer een opgeslagen artikel wordt geopend in de browser en vraagt om het artikel te beoordelen.</br></br><b>Conclusion</b></br>Door het gebruik van het ecosysteem gaat waardevolle online content niet verloren. Gebruikers kunnen terecht op het platform om content te vinden over het vakgebied. Content die gestructureerd geordend is en beoordeelt is op relevantie. Het is de plek waar mensen naar toe gaan om relevante online content over het vakgebied te ontdekken."
  },
  {
    "anchor": "inleiding",
    "chapter": "1. Inleiding",
    "text": "<p>Dit afstudeerproject is het gevolg van een persoonlijk ondervonden probleem binnen de context van TamTam. Na het aankaarten van de bevindingen over het probleem en de mogelijkheden bij TamTam is mij de mogelijkheid gegund om hiervan mijn afstudeerproject te maken.</p></br><p><strong>Aanleiding</strong></p><p>De aanleiding van dit project komt door het persoonlijke gemis van een goede manier om vakinhoudelijke online content op te slaan. Door te kijken naar de manieren waarop andere hiermee omgingen werd vrij snel duidelijk dat meer mensen dit probleem ondervinden.</p></br><p><strong>TamTam</strong></p><p>TamTam is een full-service digital agency. Dit houdt in dat zij alles verzorgen op digitaal gebied en betrokken zijn bij het hele proces, vanaf de conceptuele fase tot het programmeren van het product. TamTam telt ongeveer 200 medewerkers en behoort daarmee tot een van de grootste van Nederland. TamTam is onderdeel van Dept, een netwerk van leading digital agencies. Dept bestaat op het moment van schrijven (januari, 2018) uit 12 bedrijven gevestigd in Europa en de US.</p><p>Voor meer informatie over <a href='http://www.tamtam.nl'>TamTam</a> en <a href='http://www.deptagency.com'>Dept</a> wijs ik u graag door naar de websites.</p></br><p><strong>Context &amp; Bigger picture</strong></p><p>Het idee voor dit concept is ontstaan vanuit persoonlijke behoefte. Na veel nadenken over dit concept is binnen TamTam (specifiek de groep frontend developers) hetzelfde probleem geconcludeerd. Daarmee is TamTam de eerste usecase van dit concept.</p><p>Gedurende het hele project is in het achterhoofd gehouden dat het concept niet specifiek bedoelt is voor de frontend developers van TamTam. De essentie van het idee zou voor allerlei groepen professionals een uitkomst bieden voor het probleem. De uitdaging binnen het traject lag dan ook in het continu bij elke keuze nadenken over het feit dat het ook voor andere doelgroepen zou moeten werken. Vanuit deze gedachte is een simpel idee uitgegroeid tot een complex overkoepelend systeem dat bedacht is om zo flexibel mogelijk te blijven en uit te kunnen groeien tot een product wat voor allerlei doelgroepen een oplossing kan bieden.</p><p>Een belangrijke doelstelling vanaf het begin van het afstudeer traject was om een werkend prototype neer te zetten wat getest kan worden in een specifieke context. Gezien deze doelstelling en het feit dat het concept vanaf de grond moest worden neergezet heeft de focus binnen dit project gelegen op het conceptuele vlak en de technische realisatie. Hierdoor is minder onderzoek gedaan naar design keuze&rsquo;s.</p><p>Het logboek is te bekijken op <a href='http://logboek.tomsnepvangers.com'>logboek.tomsnepvangers.com</a></p><p>Het prototype kan bekeken worden op <a href='http://prototype.tomsnepvangers.com'>prototype.tomsnepvangers.com</a></p>"
  },
  {
    "anchor": "probleemstelling",
    "chapter": "2. Probleemstelling",
    "subchapters": [
      {
        "anchor": "probleemschets",
        "chapter": "2.1 Probleemschets",
        "text": "<p>Het vakgebied, web-development, ontwikkelt zich snel. Maandelijks komen nieuwe technieken uit, nieuwe frameworks op de markt en daarnaast wordt vooral ontzettend veel geschreven en besproken over alle ontwikkelingen.</p><p>Dit kan overweldigend zijn. Je wilt up to date blijven als developer, maar hoe doe je dit naast je fulltime job? The fear of missing out. Binnen het vakgebied ook wel &ldquo;Frontend Fatigue&rdquo; genoemd.</p><p>Hoe bepaal je als frontend developer wat relevant is voor jou en hoe bepalen frontend developers van TamTam wat relevant is voor hen om te lezen / bekijken en / of leren? Dat kan erg lastig zijn. Gelukkig heb je collega&rsquo;s, zij weten dit vaak wel.</p><p>De groep frontend developers van TamTam deelt veel met elkaar over hun expertise. Vaak is dit informatie die relevant is voor alle frontend developers van TamTam. De manier waarop dit opgeslagen en gedeeld wordt is echter niet effici&euml;nt. Links verdwijnen in de chat en Facebook groepen met het gevolg dat niet iedereen het ziet. Structuur is niet aanwezig in de chaos van alle informatie die wordt gedeeld.</p><p>Door de overload aan informatie die developers toekomt verliezen zij focus op wat zij willen of zouden moeten leren, lezen of bekijken. Dit is gebleken uit interviews met frontend developers van TamTam.</p><p>Het begrip information overload werd voor het eerst beschreven in 1964:</p><p><em>&ldquo;Information overload occurs when the amount of input to a system exceeds its processing capacity. Decision makers have fairly limited cognitive processing capacity. Consequently, when information overload occurs, it is likely that a reduction in decision quality will occur.&rdquo; -(Gross, 1964)</em></p><p>In de afbeelding naast staat de correlatie tussen de verschillende problemen.&nbsp;</p><p>Binnen de context van de situatie van de opdrachtgever zal de focus liggen tussen de eerste twee problemen. In feite helpen de frontend developers van TamTam elkaar al door relevante vakinhoudelijke inspiratie / kennis met elkaar te delen. Het probleem zit hem in de manier waarop. Omdat dit niet effici&euml;nt is, blijft het overkoepelende probleem bestaan: de overload aan informatie met als gevolg het Frontend Fatigue gevoel.</p>",
        "images": [
          {
            "src": "/assets/images/scriptie/probleem-correlatie.png",
            "caption": "Figuur 1. Correlatie tussen problemen"
          }
        ]
      },
      {
        "anchor": "design-challenge",
        "chapter": "2.2 Design Challenge",
        "type": "designchallenge",
        "fullwidth": true,
        "background": "is--color-primary",
        "text": "<p>“Hoe kan een centraal platform ervoor zorgen dat de frontend developers van TamTam elkaar up to date houden en vakinhoudelijke content met elkaar kunnen delen zodat zij niet verdrinken in de overload aan beschikbare online content over het vakgebied“</p>"
      },
      {
        "anchor": "deelvragen",
        "chapter": "2.3 Deelvragen",
        "twoColumns": true,
        "columnOne": "<h4>Conceptueel</h4><p><strong>Hoe kan structuur worden aangebracht in de chaos van alle gedeelde content?</strong></p><p>Om de information overload tegen te gaan moet er gekeken worden naar de manieren waarop er structuur kan worden aangebracht in grote hoeveelheden content. Vervolgens kan er onderzoek worden gedaan naar de design patterns van de mogelijke oplossingen. </p></br><p><strong>Hoe gaan developers in de huidige situatie om met informatie die gedeeld wordt? </strong></p><p>Inzichten in de manier waarop developers omgaan met de huidige situatie zijn erg belangrijk. Vanuit deze bevindingen wordt er gekeken naar de kansen en bedreigingen. </p></br><p><strong>Hoe kan de oplossing integreren in de bestaande werkflow en tools die momenteel worden gebruikt? </strong></p><p>Om er voor te zorgen dat developers zo min mogelijk tijd kwijt zijn aan het gebruiken van het product is het belangrijk dat deze kan integreren in de bestaande werkflow en tools die TamTam gebruikt. </p>",
        "columnTwo":"<h4>Prototyping</h4><strong>Wat is de beste techniek voor een het maken van een schaalbaar platform?</strong></p><p>Het is belangrijk dat het product schaalbaar is. Voor dit project is TamTam de use case. Echter, dit product zou in de toekomst in verschillende branches gebruikt kunnen worden. Om ervoor te zorgen dat de techniek achter het platform geschikt is om uit te breiden wordt er onderzoek gedaan naar de beste mogelijkheden. </p>"
      },
      {
        "anchor": "onderzoeksopzet",
        "chapter": "2.4 Onderzoeksopzet",
        "twoColumns": true,
        "columnOne": "<h4>User Research</h4><ul><li>Orientend Expert Review</li><li>Survey</li></ul></br><h4>Good and Bad practices</h4><ul><li>Case Study</li><li>Benchmark Creation</li><li>Comparison Chart</li></ul></br><h4>User curated content</h4><ul><li>Literature Study</li><li>Desk Research</li><li>Expert Reviews</li></ul>",
        "columnTwo":"<h4> Concept &amp; design</h4><ul><li>Flowchart</li><li>Design Pattern Research</li><li>Literature Study</li><li>Schetsen</li></ul></br><h4>Prototyping</h4><ul><li>Desk Research</li><li>Prototyping</li><li>Expert Reviews</li></ul>"
      }
    ]
  },
  {
    "anchor": "user-research",
    "chapter": "3. User Research",
    "subchapters": [
      {
        "anchor": "intro",
        "chapter": "Intro",
        "text": "<p>Om een product te ontwikkelen wat aansluit op de behoeften van de gebruiker is het essentieel om doelgroep onderzoek te doen in het begin van het traject. Het is belangrijk om de kansen en struikelpunten inzichtelijk te maken. Inspelen op deze inzichten maakt een product waarde- en succesvol.</p>"
      },
      {
        "anchor": "doelgroep",
        "chapter": "3.1 Doelgroep",
        "text": "<p>Er is tijdens het gehele traject in het achterhoofd gehouden dat dit concept niet gelimiteerd is tot TamTam. De groep frontend developers van TamTam is de use case voor dit traject, hier is immers het idee voor het product ontstaan.</p></br></br><p>De frontend developers van TamTam is een enthousiaste groep professionals die uitermate gepassioneerd zijn over hun vakgebied. Binnen deze groep wordt veel gepraat, gediscussieerd en gedeeld over het vakgebied. Dit gebeurd zowel online als offline. Van de online kanalen is Hipchat veruit de meest gebruikte. Hipchat is een soortgelijke applicatie als Slack: een chat applicatie.</p>"
      },
      {
        "anchor": "orienting-expert-reviews",
        "chapter": "3.2 Orienting Expert Reviews",
        "text": "<p>Het begin van het onderzoek is gestart met Orienting Expert Reviews. Door middel van het gesprek aan te gaan met developers is de hypothese dat zij het gevoel van information overload ervaren bevestigd. Vanuit de bevindingen van deze gesprekken zijn de vragen voor een survey uitgezet om meer concrete informatie over het gedrag van de doelgroep te bemachtigen.</p></br></br>De survey en samenvatting van de bevindingen zijn te bekijken in <a href='https://logboek.tomsnepvangers.com' target='_blank'>week 2 van het logboek.</a>"
      },
      {
        "anchor": "survey",
        "chapter": "3.3 Survey",
        "text": "<p>Om inzichten te krijgen in de huidige situatie is een survey afgenomen onder de developers. De online enquete is bewust verstuurd naar alle developers (frontend, backend, devops) van TamTam met de gedachte in het achterhoofd dat het product niet per se te specifiek op maat gemaakt moet worden voor &eacute;&eacute;n doelgroep. Daarnaast kunnen inzichten vanuit andere hoeken waardevol zijn.</p><p>De hoofdvraag van de survey luid: </p><p><strong><em>Wat missen developers tijdens het opslaan / delen van vakinhoudelijke content ?</em></strong></p></br><p>In de survey wordt gevraagd naar een aantal factoren gerelateerd aan het delen en opslaan van online content over het vakgebied. Hoe zij dit doen en of zij tevreden zijn met de manier waarop zij dit doen. Daarnaast zijn een aantal vragen voorgeschoteld die inzicht geven in de frequentie, plaats en tijd gerelateerd aan het consumeren van de online content. Deze inzichten zijn waardevol voor de concept fase. </p><p>De survey en samenvatting van de bevindingen zijn te bekijken in <a href='http://logboek.tomsnepvangers.com' target='_blank'>week 4 &amp; 5 van het logboek</a></p>"
      },
      {
        "anchor": "bevindingen",
        "chapter": "3.4 Bevindingen",
        "twoColumns": true,
        "columnOne": "<p>De belangrijkste bevinden vanuit het doelgroep onderzoek zijn hieronder per kopje beschreven.</p><p>&nbsp;</p><p><strong>Information overload</strong></p><p>Het gevoel van information overload wordt ervaren door de doelgroep. Het vakgebied ontwikkeld zich snel, daarnaast is het vakgebied uitgebreid en kan je erg diep in gaan op veel topics. In feite helpen collega&rsquo;s elkaar al bij dit probleem, zij delen relevante online content met elkaar. Hierdoor wordt het voor developers enigszins makkelijker om een keuze te maken in wat zij willen bekijken.</p><p><strong>Content opslaan</strong></p><p>91,7% van de respondenten geeft aan content op te slaan om op een later tijdstip te bekijken. De meest voorkomende manier om deze content op te slaan zijn browser bookmarks. Daarnaast worden notitie diensten zoals Evernote, Google Keep veel gebruikt en Pocket.</p><p>De meningen over de meest gebruikte manier van content opslaan, bookmarks, vat het probleem in notendop samen: Het is fijn dat alles op een centrale plek staat, maar het wordt ontzettend snel onoverzichtelijk.</p><p>Een ander opvallende reactie die meerdere keren terugkomt is het feit dat de huidige manier van opslaan als &lsquo;ok&eacute;&rsquo; wordt ervaren omdat er geen alternatief is. Hieruit valt te concluderen dat er op dit gebied kansen liggen om de gebruikerservaring te verbeteren.</p><p><strong>Content delen</strong></p><p>Hipchat is onder de frontend developers veruit de meest gebruikte tool om content te delen.</p><p>Op de vraag wat zij vinden van deze manier van delen reageren velen met de opmerking dat de content snel verdwijnt in de chat feed.</p><p>Het is opvallend dat Hipchat veel minder (80% vs 36%) wordt genoemd onder de andere developers (backend / devops). De &ldquo;andere&rdquo; developers benoemen voornamelijk Whatsapp, email en face to face gesprekken.</p><p>Onder zowel backend als frontend worden dezelfde problemen ondervonden bij de digitale manieren om content te delen:</p>",
        "columnTwo": "<p>Methode: <strong>Mail</strong></p><p>Rol: <strong>Backend developer</strong></p><p>&ldquo;<em>its okay i guess, would be nice to have an archive of some sorts with filters&rdquo;</em></p><p>&nbsp;</p><p>Methode: <strong>Hipchat </strong></p><p>Rol: <strong>Frontend developer</strong></p><p><em>&ldquo;It does not work because it is hard to find back articles if you need them again&ldquo;</em></p><p>&nbsp;</p><p>Methode: <strong>Mail&nbsp; / Workspace (Facebook for work)</strong></p><p>Rol: <strong>Backend developer</strong></p><p>&ldquo;<em>Not the best approach as eventually you'll forget about them and won't be able to find them when you need the articles/examples&rdquo;</em></p><p>&nbsp;</p><p>Methode: <strong>Hipchat </strong></p><p>Rol: <strong>Frontend developer</strong></p><p><em>&ldquo;I can't reach everyone. Especially when I share via chat, it disappears in all the other discussions going on in the chat.&rdquo;</em></p><p>&nbsp;</p><p><strong>Frequentie, plaats en tijd</strong></p><p>50% van de frontend developers bekijkt dagelijks online content over het vakgebied. De andere 50% doet dit minstens wekelijks. De plaats en tijdstippen waarop online content wordt genuttigd is voornamelijk willekeurig. Deze willekeurigheid komt voornamelijk voort uit het feit dat veel developers moeten wachten op bepaalde processen tijdens het ontwikkelen van websites.</p>"
      },
      {
        "anchor": "persona",
        "chapter": "3.5 Persona",
        "twoColumns": true,
        "columnOne": "<p>Vanuit de bevindingen van het gedane onderzoek is een persona samengesteld. Er is gekozen voor een persona met de focus op het gedrag: <em>a Behavioral Persona</em> (Bartel, 2016). Deze vorm van een persona is bedoelt voor situaties waarin de doelgroep specifiek en bekend is. In het geval van dit onderzoek is de doelgroep bekend en erg specifiek, Frontend Developer collega&rsquo;s. </p><p>&nbsp;</p><p>Binnen het persona is gekeken naar de twee belangrijkste aspecten van het gedrag in het kader van dit onderzoek: het delen en opslaan van de online content.</p>",
        "persona": true
      },
      {
        "anchor": "conclusie",
        "chapter": "3.6 Conclusie",
        "text": "<p>De doelgroep helpt elkaar een keuze te maken in de beschikbare online content over het vakgebied door stukken te delen met elkaar. Dit gaat het gevoel van information overload tegen doordat er relevante content wordt aangeboden door collega&rsquo;s.</p><p>De tools die hier momenteel voor gebruikt worden voldoen niet geheel aan de behoeftes van de doelgroep. Enerzijds is Hipchat een makkelijke tool om mee te delen. Elke Frontend Developer zit in de Frontend groep chat. Dit is een levendige chatgroep waarin veel wordt gecommuniceerd. Anderzijds is dit een applicatie welke bedoelt is als chat applicatie, niet voor het delen van online content. De links die hierin gedeeld worden verdwijnen snel in de chat feed. Hierdoor missen veel developers de content die gedeeld wordt in de chat groep.</p><p>De manieren waarop de developers (zowel backend als frontend) dit probleem momenteel proberen te tackelen werkt niet effici&euml;nt. Hipchat, e-mails en Whatsapp, overal komt hetzelfde probleem naar boven:</p><p><strong>Het terug vinden van gedeelde content op een later tijdstip is niet tot nauwelijks mogelijk.</strong></p><p>Sommige developers gebruiken bepaalde tools om de gedeelde online content op te slaan. Bij de twee meest voorkomende manieren (bookmarks en notitie apps) wordt het overzicht snel verloren, daarnaast vergt dit elke keer tijd om bij te houden. </p><p>Het is belangrijk om in het achterhoofd te houden dat de doelgroep al veel tools gebruiken. De drempel ligt hoog om nog meer extra tools te moeten gebruiken.</p>"
      }
    ]
  }
]