[
  {
    "chapter": "Voorwoord",
    "text": "</p><p>De eindstreep is in zicht. Na vier jaar ontzettend te hebben genoten van de opleiding Communication &amp; Multimedia zitten mijn laatste twintig weken er op. Het begon allemaal met de Partners in Paars, een hechte groep die al snel naam hadden gemaakt bij alle andere kleurrijke groepen in het eerste jaar van de studie. Na in 2015 samen met Gijs en Victorine de zilveren SpinAward te hebben bemachtigd in de categorie Young Talent met het concept PLECK werd &eacute;&eacute;n ding duidelijk: ik wilde in staat zijn zelf te kunnen maken wat ik in mij opkomt. Vanuit die gedachte ben ik mij gaan verdiepen in Frontend Development. Vervolgens studeer je 3 jaar later af bij &eacute;&eacute;n van de meest gerenommeerde bedrijven van Nederland, het is allemaal snel gegaan.</p><p>In een periode van 20 weken is een concept neergezet met een technisch werkend prototype wat momenteel in gebruik is door de Frontend Developers van TamTam. Het ging uiteraard niet zonder slagen of stoten, maar ik ben trots op het resultaat. </p><p>Zonder een aantal mensen was mij dit niet gelukt. Daarom wil deze mensen bedanken voor hun hulp, inzet en steun de afgelopen paar maanden.</p><p><strong>Jeroen Reumkens</strong></p><p>Jeroen, wat een topper ben jij. Na een fijne tijd als stagiair met jou als buddy kon ik mij geen beter persoon voorstellen om mij te begeleiden vanuit TamTam dan jij. Altijd positief, enthousiast en behulpzaam. Ik wil je bedanken voor alle moeite en tijd die je hebt gestoken in het helpen en begeleiden van mij.</p><p><strong>Lucas Nutbey</strong></p><p>Lucas, de strateeg van TamTam. &ldquo;Niet luisteren naar wat school wilt, maar doen wat het beste is voor je product!&rdquo; zei jij altijd. Een wijze les. Bedankt voor de inzichten en het meedenken bij het concreet maken van het concept.</p><p><strong>CMD Squad</strong></p><p>Sinds de propedeuse vormen we al de drie musketiers. Christian, Pierre en Tom. Vanaf de eerste stageperiode is de Slack groep ontstaan waarin we elke dag dingen met elkaar delen. Soms wel meer dan met de collega&rsquo;s die naast je zitten. Als mensen aan mij vragen: &ldquo;heb jij nog vrienden overgehouden aan je studie?&rdquo;, dan zeg ik zekerste weten. Bedankt voor het meedenken en het bieden van een luisterend oor tijdens klaagbakens over hoe weinig zin ik er soms meer in had.</p><p><strong>Frontend Developers van TamTam</strong></p><p>Bedankt jongens en meisjes voor het geven van feedback, testen (lees: afbranden, geintje ;)) van m&rsquo;n prototype, en vooral het rellen. Ik heb er erg om gelachen. Zonder jullie zou het product waardeloos zijn. Geef jezelf een sticker.</p>"
  },
  {
    "chapter": "Management Samenvatting",
    "text": "<b>Introduction</b></br>Ik wil dat een groep professionals een online centrale plek hebben waar zij online content over het vakgebied kunnen delen, opslaan, ontdekken en aanraden.</br></br><b>Claim</b></br>Het online ecosysteem zorgt ervoor dat een groep professionals een platform heeft met relevante online content over het vakgebied waardoor collega’s elkaar up to date houden.</br></br><b>Topic</b></br>Ik heb onderzoek gedaan naar het delen van informatie over het vakgebied tussen collega’s (frontend developers van TamTam) en hoe zij de gedeelde content opslaan om op een later moment terug te kijken. Hiermee heb ik in kaart gebracht wat voor methode’s er gebruikt worden om te delen en op te slaan. Wat de positieve en negatieve punten van deze methode’s zijn en welke zaken echt missen.</br></br><b>The study</b></br>Is de manier waarop groepen professionals inspiratie met elkaar delen over het vakgebied efficiënt? Deze vraag komt voort uit een groter overkoepelend probleem: information overload. Er zijn ontzettend veel artikelen, tutorials, websites die allerlei content voorschotelen. Wat moet jij als professional bekijken? Hoe maak je de keuze wat voor jou relevant is? De content die collega’s met elkaar delen is relevant. Echter zijn de manieren waarop dit opgeslagen wordt niet efficiënt. De links naar de online content verdwijnen in chat of mail feeds, waardoor het erg lastig is om deze op een later moment terug te vinden.</br></br><b>Results</b></br>De mening onder frontend developers van TamTam over dit topic is verdeeld. Enerzijds zeggen een aantal van hen dat delen via hipchat en mail oke is. Overigens werd door deze personen vermeld dat er geen andere manier is. Het andere deel vind dat de manier waarop het nu wordt gedeeld niet efficiënt is. Links verdwijnen in de chat feed en het handmatig moeten opslaan in een notitie app is niet handig. Daarnaast hebben developers behoefte aan een indicatie van relevantie. Ook is het belangrijk dat het systeem zich integreert binnen de huidige workflow van het bedrijf.</br></br><b>Discussion</b></br>De uitdaging die zich voordoet is om er voor te zorgen de information overload zich niet verplaatst naar het platform. Als artikelen op het platform gezet worden krijg je uiteindelijk ook een overload aan content. Om dit tegen te gaan wordt er gebruik gemaakt van zelf toegevoegde categorieën en filters. Daarnaast is er een recommandatie systeem toegevoegd om de relevantie van artikelen aan te tonen. Zo kunnen de gebruikers sneller beoordelen wat zij willen lezen. Bovendien lokt het discussie uit. Artikelen die al gelezen zijn worden in het archief gezet. Een ander heikelpunt is het toevoegen van de artikelen, de vraag is of gebruikers dat wel gaan doen. De drempel moet zo laag mogelijk gemaakt worden om zowel content toe te voegen als te beoordelen. Vanuit die gedachte is het ecosysteem opgezet. De huidige services die gebruikt worden delen automatisch de content naar de database. Zo blijft de huidige manier van delen bestaan, het delen via hipchat, en integreert het eco systeem binnen de huidige werkflow (of beter gezegd, integreert de huidige werkflow binnen het ecosysteem). Een browser extensie detecteert wanneer een opgeslagen artikel wordt geopend in de browser en vraagt om het artikel te beoordelen.</br></br><b>Conclusion</b></br>Door het gebruik van het ecosysteem gaat waardevolle online content niet verloren. Gebruikers kunnen terecht op het platform om content te vinden over het vakgebied. Content die gestructureerd geordend is en beoordeelt is op relevantie. Het is de plek waar mensen naar toe gaan om relevante online content over het vakgebied te ontdekken."
  }
]